[
    {
        "Film Name": "The Shawshank Redemption",
        "Clue": "Here are 5 clues for you to guess \"The Shawshank Redemption\":\n\n1.  The protagonist's initial hope for freedom is fueled by a seemingly impossible dream.\n2.  The film explores the power of friendship and resilience in the face of adversity.\n3.  A symbol of hope and redemption is found in a small, seemingly insignificant object.\n4.  The film's setting is a place of both despair and unexpected beauty.\n5.  The journey towards freedom is paved with both hardship and moments of quiet triumph."
    },
    {
        "Film Name": "The Godfather",
        "Clue": "Here are 5 clues for you to guess \"The Godfather\":\n\n1.  The film's central conflict revolves around a family's power and legacy.\n2.  A powerful figure's life is threatened by a rival family's actions.\n3.  The film explores themes of loyalty, betrayal, and the consequences of violence.\n4.  A complex family dynamic is at the heart of the story.\n5.  The film's setting is a world of organized crime and corruption."
    },
    {
        "Film Name": "The Dark Knight",
        "Clue": "Here are 5 clues for you to guess \"The Dark Knight\":\n\n1.  A chilling symbol of fear and chaos is prominently displayed.\n2.  A complex moral dilemma forces a hero to question his own beliefs.\n3.  A city is gripped by a wave of fear and violence.\n4.  A high-stakes game of cat and mouse unfolds between two powerful figures.\n5.  A tragic event leaves a lasting impact on the city and its inhabitants."
    },
    {
        "Film Name": "The Godfather Part II",
        "Clue": "Here are 5 clues for you to guess \"The Godfather Part II\":\n\n1.  The film begins with a flashback to a pivotal moment in the protagonist's past.\n2.  The protagonist's journey is marked by a struggle for power and control.\n3.  The film explores themes of family, loyalty, and betrayal.\n4.  The protagonist faces a moral dilemma that forces him to question his values.\n5.  The film features a complex and intricate plot with multiple storylines."
    },
    {
        "Film Name": "12 Angry Men",
        "Clue": "Here are 5 clues for you to guess the film 12 Angry Men:\n\n1.  The setting is a confined space with limited options.\n2.  A single juror's opinion can change the course of the trial.\n3.  The film explores the power of individual thought and dissent.\n4.  The tension builds through a series of heated arguments.\n5.  The film's message is about the importance of justice and fairness."
    },
    {
        "Film Name": "Schindler's List",
        "Clue": "Here are 5 clues for you to guess \"Schindler's List\":\n\n1. The film depicts a pivotal moment in history.\n2. The setting is a time of immense societal upheaval.\n3. The story revolves around a complex moral dilemma.\n4. The film explores themes of survival and redemption.\n5. The film's impact is undeniable and continues to resonate today."
    },
    {
        "Film Name": "The Lord of the Rings: The Return of the King",
        "Clue": "Here are 5 clues for you to guess \"The Lord of the Rings: The Return of the King\":\n\n1.  The fate of a kingdom hangs in the balance.\n2.  A journey of immense sacrifice is undertaken.\n3.  A powerful artifact is sought after with great urgency.\n4.  A final battle is fought for the very soul of Middle-earth.\n5.  The power of hope and courage prevails in the face of overwhelming darkness."
    },
    {
        "Film Name": "Pulp Fiction",
        "Clue": "1. The film features a memorable diner scene with a twist.\n2. A briefcase holds a significant secret.\n3. A character's fate is determined by a fateful encounter.\n4. The film explores themes of violence and redemption.\n5. A memorable dance sequence takes place in a dimly lit room."
    },
    {
        "Film Name": "The Lord of the Rings: The Fellowship of the Ring",
        "Clue": "Here are 5 clues for you to guess \"The Lord of the Rings: The Fellowship of the Ring\":\n\n1.  A small, unassuming object holds immense power.\n2.  A journey begins with a simple request.\n3.  A dark and ancient evil stirs in the shadows.\n4.  Friendship and loyalty are tested in the face of danger.\n5.  A prophecy foretells a battle for the fate of the world."
    },
    {
        "Film Name": "The Good, the Bad and the Ugly",
        "Clue": "Here are 5 clues for you to guess \"The Good, the Bad and the Ugly\":\n\n1.  The film features a classic Western showdown.\n2.  The setting is a desolate and unforgiving landscape.\n3.  A treasure hunt drives the plot forward.\n4.  The film is known for its iconic score.\n5.  The film's ending is a memorable and bittersweet moment."
    },
    {
        "Film Name": "Forrest Gump",
        "Clue": "Here are 5 clues for you to guess \"Forrest Gump\":\n\n1. The film features a beloved American icon.\n2. The protagonist's journey is marked by both joy and tragedy.\n3. The story is set against a backdrop of significant historical events.\n4. The film explores themes of love, loss, and the power of perseverance.\n5. The protagonist's simple life is filled with unexpected adventures."
    },
    {
        "Film Name": "The Lord of the Rings: The Two Towers",
        "Clue": "Here are 5 clues for you to guess \"The Lord of the Rings: The Two Towers\":\n\n1.  A journey of great distance and peril is undertaken.\n2.  A powerful artifact is sought after by many.\n3.  A battle for survival takes place in a vast and dangerous landscape.\n4.  A betrayal shatters trust and creates conflict.\n5.  A desperate fight for freedom is waged against overwhelming odds."
    },
    {
        "Film Name": "Fight Club",
        "Clue": "Here are 5 clues for you to guess \"Fight Club\":\n\n1.  The protagonist finds solace in a world of chaos and rebellion.\n2.  The film explores the complexities of masculinity and consumerism.\n3.  A seemingly ordinary object becomes a symbol of power and control.\n4.  The film uses symbolism to represent the inner turmoil of its characters.\n5.  The film's ending leaves viewers with a sense of ambiguity and questioning."
    },
    {
        "Film Name": "Inception",
        "Clue": "Here are 5 clues for you to guess \"Inception\":\n\n1.  The protagonist's dream-weaving abilities are a crucial part of his profession.\n2.  A shared dream world is a dangerous place for those who enter it.\n3.  The film explores the nature of reality and perception.\n4.  A powerful symbol is used to represent the subconscious mind.\n5.  The film's climax involves a complex and dangerous heist."
    },
    {
        "Film Name": "Star Wars: Episode V - The Empire Strikes Back",
        "Clue": "Here are 5 clues for you to guess \"Star Wars: Episode V - The Empire Strikes Back\":\n\n1.  The protagonist faces a difficult choice that will have lasting consequences.\n2.  A chilling battle takes place on a frozen planet.\n3.  A beloved character undergoes a significant transformation.\n4.  A mysterious figure delivers a cryptic message.\n5.  The fate of the rebellion hangs in the balance."
    },
    {
        "Film Name": "The Matrix",
        "Clue": "Here are 5 clues for you to guess \"The Matrix\":\n\n1.  The protagonist's reality is constantly questioned.\n2.  A red pill represents a choice between truth and ignorance.\n3.  The film explores the nature of reality and perception.\n4.  A powerful force seeks to control the world's inhabitants.\n5.  The film features groundbreaking visual effects."
    },
    {
        "Film Name": "GoodFellas",
        "Clue": "Here are 5 clues for you to guess \"Goodfellas\":\n\n1.  The film is set in a specific decade.\n2.  The protagonist's life is marked by a constant pursuit of power.\n3.  The film features a complex and morally ambiguous protagonist.\n4.  The film explores the themes of loyalty and betrayal.\n5.  The film's soundtrack is a blend of classic and contemporary music."
    },
    {
        "Film Name": "One Flew Over the Cuckoo's Nest",
        "Clue": "Here are 5 clues for you to guess \"One Flew Over the Cuckoo's Nest\":\n\n1.  The setting is a place of confinement and control.\n2.  A rebellious spirit challenges the established order.\n3.  A game of chance and risk is at the heart of the story.\n4.  The power of the mind is a central theme.\n5.  The film explores the complexities of human relationships."
    },
    {
        "Film Name": "Interstellar",
        "Clue": "Here are 5 clues for you to guess the film Interstellar:\n\n1.  The film features a journey through a wormhole.\n2.  A mysterious force drives the characters' actions.\n3.  The characters face a desperate race against time.\n4.  The film explores the concept of human connection.\n5.  The film's visuals are breathtaking and awe-inspiring."
    },
    {
        "Film Name": "Seven",
        "Clue": "Here are 5 clues for you to guess the film \"Seven\":\n\n1. The film's setting is a city known for its dark underbelly.\n2. A detective's personal demons are intertwined with the case.\n3. The film explores the nature of good and evil.\n4. A shocking twist reveals the true nature of the killer's motives.\n5. The film's climax is a violent and unforgettable confrontation."
    },
    {
        "Film Name": "It's a Wonderful Life",
        "Clue": "Here are 5 clues for you to guess \"It's a Wonderful Life\":\n\n1. The film takes place during a time of great economic hardship.\n2. A man's life is turned upside down by a sudden event.\n3. The protagonist's actions have a profound impact on those around him.\n4. The film explores themes of redemption and second chances.\n5. The film's message is one of hope and the importance of community."
    },
    {
        "Film Name": "Seven Samurai",
        "Clue": "Here are 5 clues for you to guess \"Seven Samurai\":\n\n1.  The film features a group of skilled warriors who are hired to protect a village.\n2.  The setting is a rural Japanese village facing a threat from bandits.\n3.  The film explores themes of honor, duty, and the cost of protecting others.\n4.  The film is known for its stunning cinematography and epic battle sequences.\n5.  The film's ending is both hopeful and tragic."
    },
    {
        "Film Name": "The Silence of the Lambs",
        "Clue": "Here are 5 clues for you to guess \"The Silence of the Lambs\":\n\n1.  The film features a chilling portrayal of a serial killer's mind.\n2.  A young FBI trainee seeks guidance from a brilliant but dangerous criminal.\n3.  The film explores the dark side of human nature and the complexities of justice.\n4.  The story is set in a world of psychological suspense and moral ambiguity.\n5.  The film's iconic score adds to the atmosphere of dread and tension."
    },
    {
        "Film Name": "Saving Private Ryan",
        "Clue": "Here are 5 clues for you to guess Saving Private Ryan:\n\n1. The film opens with a dramatic and intense scene of war.\n2. The main character is tasked with a difficult and dangerous mission.\n3. The film features a pivotal battle that is both brutal and memorable.\n4. The film explores themes of brotherhood and sacrifice.\n5. The film's ending is both powerful and emotionally resonant."
    },
    {
        "Film Name": "City of God",
        "Clue": "Here are 5 clues for you to guess the film \"City of God\":\n\n1. The film is set in a specific, impoverished neighborhood.\n2. The story is told through the eyes of a young boy growing up in the city.\n3. The film explores themes of violence, poverty, and social inequality.\n4. The film features a vibrant and gritty portrayal of life in the favelas.\n5. The film's soundtrack is a mix of traditional Brazilian music and modern hip-hop."
    },
    {
        "Film Name": "Life Is Beautiful",
        "Clue": "Here are 5 clues for you to guess the film \"Life Is Beautiful\":\n\n1. The film is set in a time of great historical upheaval.\n2. The protagonist uses humor to cope with a difficult situation.\n3. The film explores themes of love and family.\n4. The film's setting is both beautiful and dangerous.\n5. The film's ending is both hopeful and heartbreaking."
    },
    {
        "Film Name": "The Green Mile",
        "Clue": "Here are 5 clues for you to guess \"The Green Mile\":\n\n1. The setting is a place of both hope and despair.\n2. A powerful and unexpected event changes the course of the story.\n3. The protagonist grapples with moral dilemmas and difficult choices.\n4. The film explores themes of justice, mercy, and the human condition.\n5. The film features a unique and unforgettable visual style."
    },
    {
        "Film Name": "Terminator 2: Judgment Day",
        "Clue": "Here are 5 clues for you to guess \"Terminator 2: Judgment Day\":\n\n1.  A young boy's life is in danger from a relentless machine.\n2.  A scientist makes a crucial decision that could change the future.\n3.  A battle between man and machine takes place in a futuristic world.\n4.  A powerful weapon is used to protect a young boy from a deadly threat.\n5.  A time-traveling machine plays a key role in the story."
    },
    {
        "Film Name": "Star Wars: Episode IV - A New Hope",
        "Clue": "Here are 5 clues for you to guess Star Wars: Episode IV - A New Hope:\n\n1.  A young boy dreams of a faraway galaxy.\n2.  A group of rebels fight against an oppressive empire.\n3.  A powerful weapon is sought after by both sides of a conflict.\n4.  A farm boy becomes a hero in a galaxy far, far away.\n5.  A message in a bottle leads to a dangerous mission."
    },
    {
        "Film Name": "Back to the Future",
        "Clue": "Here are 5 clues for you to guess \"Back to the Future\":\n\n1.  A DeLorean time machine is the central element of the story.\n2.  The protagonist travels through time to change his future.\n3.  A young man's journey takes him to a pivotal moment in his family's history.\n4.  A quirky scientist plays a crucial role in the time travel adventure.\n5.  The film features a blend of science fiction and classic rock music."
    },
    {
        "Film Name": "Spirited Away",
        "Clue": "1. The film takes place in a fantastical world with unique creatures.\n2. A young girl must overcome challenges to save her parents.\n3. The protagonist uses her ingenuity and resourcefulness to survive.\n4. The film explores themes of transformation and self-discovery.\n5. The setting is a place of both beauty and danger."
    },
    {
        "Film Name": "The Pianist",
        "Clue": "Here are 5 clues for you to guess \"The Pianist\":\n\n1. The film depicts a brutal and unforgiving period of history.\n2. The protagonist's survival depends on his ability to adapt and change.\n3. The film explores themes of resilience and the power of music.\n4. The protagonist faces unimaginable hardship and loss.\n5. The film is a powerful and moving testament to the human spirit."
    },
    {
        "Film Name": "Parasite",
        "Clue": "Here are 5 clues for you to guess the film Parasite:\n\n1. The film explores themes of class disparity and social mobility.\n2. A family's desperate attempt to improve their lives leads to unexpected consequences.\n3. The film utilizes a unique and unconventional narrative structure.\n4. The setting is a stark contrast between wealth and poverty.\n5. The film's ending is both shocking and thought-provoking."
    },
    {
        "Film Name": "Psycho",
        "Clue": "Here are 5 clues for you to guess \"Psycho\":\n\n1.  The film's iconic shower scene is a pivotal moment in the narrative.\n2.  A young woman travels to a remote location seeking a fresh start.\n3.  The protagonist's past holds a dark secret that threatens to unravel her present.\n4.  The film explores themes of obsession, manipulation, and the fragility of sanity.\n5.  The film's ending leaves a lasting impression on the viewer, prompting reflection and discussion."
    },
    {
        "Film Name": "Gladiator",
        "Clue": "Here are 5 clues for you to guess the film Gladiator:\n\n1. The film features a brutal and unforgiving world of ancient warfare.\n2. The protagonist is driven by a deep sense of loyalty and vengeance.\n3. The film explores themes of power, betrayal, and redemption.\n4. The setting is a vast and complex empire with a rich history.\n5. The film features stunning visual effects and epic battle sequences."
    },
    {
        "Film Name": "The Lion King",
        "Clue": "Here are 5 clues for you to guess \"The Lion King\":\n\n1.  The film features a vibrant and diverse African landscape.\n2.  A young lion must overcome challenges to claim his rightful place.\n3.  A powerful voice narrates the story of a young lion's journey.\n4.  The film explores themes of family, responsibility, and courage.\n5.  The film is known for its memorable musical score and iconic songs."
    },
    {
        "Film Name": "Spider-Man: Across the Spider-Verse",
        "Clue": "Here are 5 clues for you to guess \"Spider-Man: Across the Spider-Verse\":\n\n1.  The film features a unique visual style that blends animation with a realistic aesthetic.\n2.  The protagonist faces a complex moral dilemma that challenges their understanding of responsibility.\n3.  The story explores the concept of identity and the weight of expectations.\n4.  A pivotal event forces the protagonist to confront their past and make difficult choices.\n5.  The film delves into the consequences of actions and the ripple effect they can have on others."
    },
    {
        "Film Name": "The Departed",
        "Clue": "Here are 5 clues for you to guess \"The Departed\":\n\n1. The film features a tense cat-and-mouse game between two groups.\n2. The setting is a city known for its organized crime.\n3. A key element of the plot involves undercover work.\n4. The film explores themes of loyalty and betrayal.\n5. The ending is a dramatic and unexpected twist."
    },
    {
        "Film Name": "Leon",
        "Clue": "Here are 5 clues for you to guess the film *Leon*:\n\n1. The protagonist is a skilled and meticulous assassin.\n2. The film features a tense and suspenseful atmosphere.\n3. The setting is a bustling city with a dark underbelly.\n4. The film explores themes of morality and the consequences of violence.\n5. The protagonist's actions have far-reaching and unexpected consequences."
    },
    {
        "Film Name": "Whiplash",
        "Clue": "Here are 5 clues for you to guess the film *Whiplash*:\n\n1.  The film features a highly competitive and demanding environment.\n2.  The protagonist's ambition is fueled by a desire for perfection.\n3.  The film explores the lengths to which someone will go to achieve their goals.\n4.  The film's soundtrack is a key element in building tension and emotional impact.\n5.  The film's ending leaves a lasting impression on the viewer."
    },
    {
        "Film Name": "American History X",
        "Clue": "Here are 5 clues for you to guess \"American History X\":\n\n1. The film explores the complexities of race relations in a modern society.\n2. The protagonist undergoes a significant personal transformation.\n3. The film tackles themes of redemption and second chances.\n4. The setting is a place where prejudice and violence are deeply ingrained.\n5. The film uses a powerful combination of realism and symbolism."
    },
    {
        "Film Name": "Dune: Part Two",
        "Clue": "Here are 5 clues for you to guess Dune: Part Two:\n\n1.  The fate of a powerful weapon hangs in the balance.\n2.  A journey across a vast and dangerous landscape is undertaken.\n3.  A new threat emerges from the depths of space.\n4.  A complex web of alliances and betrayals unfolds.\n5.  The struggle for power reaches a critical point."
    },
    {
        "Film Name": "The Prestige",
        "Clue": "Here are 5 clues for you to guess \"The Prestige\":\n\n1.  The film explores the lengths people will go to for recognition and success.\n2.  A rivalry between two magicians drives the plot forward.\n3.  The line between reality and illusion blurs throughout the story.\n4.  A hidden secret holds the key to a powerful magic trick.\n5.  The pursuit of a specific goal leads to unexpected consequences."
    },
    {
        "Film Name": "Grave of the Fireflies",
        "Clue": "Here are 5 clues for you to guess the film *Grave of the Fireflies*:\n\n1. The film depicts a devastating event that leaves a lasting impact on the characters.\n2. The setting is a world consumed by war and its aftermath.\n3. The characters struggle to survive in a harsh and unforgiving environment.\n4. The film explores themes of loss, hope, and the fragility of life.\n5. The film's ending is both heartbreaking and thought-provoking."
    },
    {
        "Film Name": "Harakiri",
        "Clue": "Here are 5 clues for you to guess the film \"Harakiri\":\n\n1. The film explores themes of honor and duty in a strict social hierarchy.\n2. The setting is a feudal Japanese estate, steeped in tradition and rigid social structures.\n3. A pivotal event triggers a chain of events that leads to a dramatic confrontation.\n4. The protagonist's actions are driven by a complex mix of personal and societal pressures.\n5. The film's ending is both tragic and thought-provoking."
    },
    {
        "Film Name": "The Usual Suspects",
        "Clue": "Here are 5 clues for you to guess \"The Usual Suspects\":\n\n1. The film's central mystery revolves around a single, pivotal moment.\n2. The protagonist's past is shrouded in secrecy and deception.\n3. The film utilizes a unique narrative structure, playing with time and perspective.\n4. The film's ending is both shocking and thought-provoking.\n5. The film's themes explore the nature of truth and perception."
    },
    {
        "Film Name": "Casablanca",
        "Clue": "Here are 5 clues for you to guess Casablanca:\n\n1.  The film takes place during a time of global conflict.\n2.  A forbidden love story unfolds amidst a backdrop of political turmoil.\n3.  A pivotal location holds immense significance for the characters involved.\n4.  A dangerous game of deception and betrayal is played out.\n5.  The film explores themes of sacrifice and redemption."
    },
    {
        "Film Name": "Untouchable",
        "Clue": "Here are 5 clues for you to guess the film \"Untouchable\":\n\n1. The film is set in a specific time period.\n2. The protagonist faces a significant social barrier.\n3. The film explores themes of class and privilege.\n4. The protagonist's actions have a profound impact on others.\n5. The film features a complex and morally ambiguous character."
    },
    {
        "Film Name": "Cinema Paradiso",
        "Clue": "Here are 5 clues for you to guess \"Cinema Paradiso\":\n\n1. The film is set in a small Italian town.\n2. The protagonist's passion for cinema is a driving force in his life.\n3. The film explores themes of nostalgia and the power of memories.\n4. The setting features a vibrant and bustling community.\n5. The film is a bittersweet reflection on the passage of time."
    },
    {
        "Film Name": "Modern Times",
        "Clue": "Here are 5 clues for you to guess the film \"Modern Times\":\n\n1. The film features a character who is constantly trying to escape a monotonous and repetitive job.\n2. The setting is a bustling city with a fast-paced and chaotic atmosphere.\n3. The film uses a unique visual style to depict the struggles of the working class.\n4. The protagonist's attempts to improve his life often lead to humorous and frustrating situations.\n5. The film explores themes of alienation, consumerism, and the search for meaning in a modern world."
    },
    {
        "Film Name": "Rear Window",
        "Clue": "Here are 5 clues for you to guess \"Rear Window\":\n\n1.  The setting is a place of confinement.\n2.  A crime is committed, but the perpetrator is not easily seen.\n3.  The protagonist's perspective is limited by his physical limitations.\n4.  The film explores themes of voyeurism and isolation.\n5.  The resolution is a twist on the classic whodunit."
    },
    {
        "Film Name": "Alien",
        "Clue": "Here are 5 clues for you to guess the film Alien:\n\n1. The protagonist's journey takes place aboard a spacecraft.\n2. The creature's appearance is both terrifying and grotesque.\n3. The film explores themes of isolation and the unknown.\n4. The setting is a claustrophobic and hostile environment.\n5. The creature's presence has a profound impact on the crew's sanity. \n\n\nLet me know when you think you have the answer!"
    },
    {
        "Film Name": "Once Upon a Time in the West",
        "Clue": "Here are 5 clues for you to guess \"Once Upon a Time in the West\":\n\n1.  The film features a showdown in a dusty, desolate landscape.\n2.  A train is a central element of the story's plot.\n3.  The film explores themes of revenge and justice.\n4.  A complex web of alliances and betrayals unfolds.\n5.  The film is known for its iconic score and memorable imagery."
    },
    {
        "Film Name": "City Lights",
        "Clue": "Here are 5 clues for you to guess the film \"City Lights\":\n\n1.  The film features a poignant portrayal of poverty and hardship.\n2.  A central theme revolves around the power of love and compassion.\n3.  The setting is a bustling metropolis with a distinct social hierarchy.\n4.  The film explores the complexities of human relationships.\n5.  The protagonist's journey is marked by both joy and sorrow."
    },
    {
        "Film Name": "Django Unchained",
        "Clue": "Here are 5 clues for you to guess \"Django Unchained\":\n\n1.  The film takes place in a time of great social upheaval and change.\n2.  A powerful figure seeks to control a specific commodity.\n3.  The protagonist is driven by a deep sense of vengeance.\n4.  The film features a complex and morally ambiguous relationship.\n5.  The setting is both beautiful and brutal. \n\n\nLet me know when you think you have the answer!"
    },
    {
        "Film Name": "Apocalypse Now",
        "Clue": "Here are 5 clues for you to guess \"Apocalypse Now\":\n\n1. The film features a journey through a war-torn landscape.\n2. The protagonist is driven by a personal quest for meaning.\n3. The film explores the psychological effects of war on individuals.\n4. The setting is inspired by a real historical event.\n5. The film's soundtrack is a blend of classical and contemporary music."
    },
    {
        "Film Name": "Memento",
        "Clue": "Here are 5 clues for you to guess Memento:\n\n1. The protagonist suffers from a debilitating condition that affects his memory.\n2. The film utilizes a non-linear narrative structure.\n3. The film explores themes of identity and perception.\n4. The protagonist's actions have significant consequences for those around him.\n5. The film's ending is deliberately ambiguous."
    },
    {
        "Film Name": "WALLÂ·E",
        "Clue": "Here are 5 clues for you to guess WALL-E:\n\n1. The film takes place in a future where Earth is uninhabitable.\n2. A small robot is the main protagonist of the story.\n3. The film explores themes of love and environmentalism.\n4. The film features a unique and memorable soundtrack.\n5. The film's visual style is distinctive and futuristic."
    },
    {
        "Film Name": "Raiders of the Lost Ark",
        "Clue": "Here are 5 clues for you to guess \"Raiders of the Lost Ark\":\n\n1.  The protagonist is a globe-trotting adventurer.\n2.  A powerful artifact is sought after by many.\n3.  The journey takes the hero through dangerous landscapes.\n4.  A mysterious organization plays a significant role.\n5.  The film features thrilling action sequences."
    },
    {
        "Film Name": "12th Fail",
        "Clue": "Here are 5 clues for you to guess the film \"12th Fail\":\n\n1. The film features a protagonist struggling with a significant personal challenge.\n2. The setting is a place of intense pressure and competition.\n3. The protagonist's journey involves overcoming obstacles and self-doubt.\n4. The film explores themes of perseverance and the pursuit of dreams.\n5. The protagonist's actions have far-reaching consequences. \n\n\nLet me know when you think you have the answer!"
    },
    {
        "Film Name": "The Lives of Others",
        "Clue": "Here are 5 clues for you to guess \"The Lives of Others\":\n\n1. The film takes place in a time of political repression.\n2. A secret surveillance operation is a key element of the plot.\n3. The film explores themes of love, betrayal, and sacrifice.\n4. The setting is a small, seemingly ordinary apartment building.\n5. The film's ending is both hopeful and tragic."
    },
    {
        "Film Name": "Sunset Blvd.",
        "Clue": "Here are 5 clues for you to guess the film *Sunset Boulevard*:\n\n1. The setting is a time of great change and upheaval.\n2. A faded Hollywood star clings to a fading dream.\n3. A young, ambitious screenwriter finds themselves in a dangerous situation.\n4. The line between reality and fantasy blurs.\n5. The film explores the dark side of fame and ambition."
    },
    {
        "Film Name": "Avengers: Infinity War",
        "Clue": "Here are 5 clues for you to guess \"Avengers: Infinity War\":\n\n1.  A powerful artifact is sought after by many.\n2.  A battle for the fate of the universe is imminent.\n3.  A sacrifice is made for a greater good.\n4.  A team of heroes faces a formidable enemy.\n5.  The world is plunged into chaos."
    },
    {
        "Film Name": "Paths of Glory",
        "Clue": "Here are 5 clues for you to guess the film *Paths of Glory*:\n\n1.  The film explores the themes of duty, honor, and the futility of war.\n2.  The setting is a brutal and unforgiving battlefield.\n3.  The film features a complex and morally ambiguous protagonist.\n4.  The film is a powerful indictment of military bureaucracy.\n5.  The film's ending is both tragic and thought-provoking."
    },
    {
        "Film Name": "Spider-Man: Into the Spider-Verse",
        "Clue": "Here are 5 clues for you to guess \"Spider-Man: Into the Spider-Verse\":\n\n1. The film features a unique visual style.\n2. The protagonist faces a complex moral dilemma.\n3. A powerful villain seeks to manipulate the multiverse.\n4. The story explores themes of family and responsibility.\n5. The film utilizes a blend of animation and live-action elements. \n\n\nLet me know when you think you have the answer!"
    },
    {
        "Film Name": "Witness for the Prosecution",
        "Clue": "Here are 5 clues for you to guess \"Witness for the Prosecution\":\n\n1. The case revolves around a complex legal battle with a surprising twist.\n2. A powerful lawyer takes on a challenging case with a strong moral compass.\n3. The courtroom drama unfolds against a backdrop of social injustice.\n4. A key piece of evidence is revealed through a dramatic confrontation.\n5. The film explores themes of truth, justice, and the power of perception."
    },
    {
        "Film Name": "The Shining",
        "Clue": "Here are 5 clues for you to guess \"The Shining\":\n\n1. The setting is a place of isolation and grandeur.\n2. A family's vacation turns into a terrifying ordeal.\n3. A sinister presence lurks within the walls.\n4. The protagonist's sanity is slowly unraveling.\n5. The film explores themes of family, addiction, and the supernatural."
    },
    {
        "Film Name": "The Great Dictator",
        "Clue": "Here are 5 clues for you to guess \"The Great Dictator\":\n\n1.  The film features a satirical portrayal of a dictator's rise to power.\n2.  The film uses humor to address serious social and political issues.\n3.  The film's setting is a fictionalized version of a real-world country.\n4.  The film's protagonist is a Jewish barber who becomes a symbol of resistance.\n5.  The film's message is a call for tolerance and understanding."
    },
    {
        "Film Name": "Aliens",
        "Clue": "Here are 5 clues for you to guess the film *Aliens*:\n\n1.  The setting is a remote, dangerous location.\n2.  A group of people face a terrifying threat.\n3.  The threat is highly intelligent and deadly.\n4.  The protagonist is a skilled and resourceful survivor.\n5.  The film features a tense and suspenseful atmosphere."
    },
    {
        "Film Name": "Inglourious Basterds",
        "Clue": "Here are 5 clues for you to guess \"Inglourious Basterds\":\n\n1.  The film features a historical event that is reimagined with a violent twist.\n2.  The protagonist's actions are driven by a strong sense of revenge.\n3.  The film utilizes a unique blend of humor and violence.\n4.  The setting is a time of intense political and social upheaval.\n5.  The film's climax is a thrilling and unexpected showdown."
    },
    {
        "Film Name": "The Dark Knight Rises",
        "Clue": "Here are 5 clues for you to guess \"The Dark Knight Rises\":\n\n1.  The protagonist faces a final, desperate battle.\n2.  A symbol of hope is threatened by a powerful force.\n3.  A city is caught in the crossfire of a violent conflict.\n4.  A long-awaited reunion takes place under unusual circumstances.\n5.  The line between good and evil is blurred in a climactic confrontation."
    },
    {
        "Film Name": "Coco",
        "Clue": "Here are 5 clues for you to guess the film Coco:\n\n1. The film takes place in a vibrant, colorful world.\n2. A family's history is intertwined with music and tradition.\n3. A magical journey takes place beyond the veil of death.\n4. A beloved family heirloom holds a special significance.\n5. The film explores themes of family, love, and remembrance."
    },
    {
        "Film Name": "Amadeus",
        "Clue": "Here are 5 clues for you to guess the film Amadeus:\n\n1.  The film features a complex and dramatic relationship between two musical geniuses.\n2.  The story takes place in a time of great artistic and political upheaval.\n3.  The film explores themes of jealousy, ambition, and the power of music.\n4.  The protagonist's downfall is a result of his own actions and choices.\n5.  The film is a historical drama with a strong focus on music and its impact on society."
    },
    {
        "Film Name": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb",
        "Clue": "Here are five clues for you to guess the film:\n\n1.  The film features a tense standoff between two powerful figures.\n2.  The setting is a world on the brink of nuclear war.\n3.  A comedic element is used to highlight the seriousness of the situation.\n4.  The film explores the absurdity of Cold War paranoia.\n5.  The film's ending is both shocking and thought-provoking. \n\n\nLet me know when you think you have the answer!"
    },
    {
        "Film Name": "Oldboy",
        "Clue": "Here are 5 clues for you to guess the film Oldboy:\n\n1. The protagonist is imprisoned for an unknown crime.\n2. The film features a brutal and violent revenge plot.\n3. The setting is a claustrophobic and oppressive environment.\n4. The protagonist undergoes a significant physical transformation.\n5. The film explores themes of isolation and redemption."
    },
    {
        "Film Name": "Toy Story",
        "Clue": "1. The film features a group of toys living in a child's room.\n2. A cowboy doll is the protagonist of the story.\n3. The toys are brought to life when the child is not around.\n4. A mischievous toy causes trouble for the others.\n5. The film explores themes of friendship and belonging."
    },
    {
        "Film Name": "American Beauty",
        "Clue": "Here are 5 clues for you to guess \"American Beauty\":\n\n1.  The film explores the complexities of suburban life.\n2.  A character's pursuit of a seemingly unattainable ideal leads to unexpected consequences.\n3.  The film uses a unique visual style to depict its characters and their world.\n4.  A pivotal moment in the film involves a change in perspective.\n5.  The film tackles themes of beauty, desire, and disillusionment."
    },
    {
        "Film Name": "Avengers: Endgame",
        "Clue": "Here are 5 clues for you to guess \"Avengers: Endgame\":\n\n1.  The stakes are higher than ever before.\n2.  A time-traveling device is used to achieve a specific goal.\n3.  A sacrifice is made to save the universe.\n4.  A powerful weapon is used to fight a formidable enemy.\n5.  The fate of the world hangs in the balance."
    },
    {
        "Film Name": "Braveheart",
        "Clue": "Here are 5 clues for you to guess \"Braveheart\":\n\n1. The film takes place in a time of great political upheaval.\n2. The protagonist is driven by a strong sense of justice and revenge.\n3. The landscape of the film is both beautiful and harsh.\n4. The film features a powerful and emotional love story.\n5. The film explores themes of freedom and sacrifice."
    },
    {
        "Film Name": "Das Boot",
        "Clue": "Here are 5 clues for you to guess \"Das Boot\":\n\n1. The film takes place in a claustrophobic environment.\n2. The setting is a war-torn world.\n3. The characters are forced to rely on their wits and courage.\n4. The film explores the psychological effects of war.\n5. The film is known for its realistic depiction of submarine life."
    },
    {
        "Film Name": "Good Will Hunting",
        "Clue": "Here are 5 clues for you to guess \"Good Will Hunting\":\n\n1.  The film's setting is a place of both intellectual pursuit and personal struggle.\n2.  A young man's talent is recognized by a renowned professor.\n3.  The film explores themes of self-discovery and the power of human connection.\n4.  A complex relationship between two individuals drives the narrative.\n5.  The film's ending offers a message of hope and redemption."
    },
    {
        "Film Name": "Princess Mononoke",
        "Clue": "Here are 5 clues for you to guess Princess Mononoke:\n\n1. The film features a clash between two powerful forces.\n2. The setting is a world of both beauty and danger.\n3. A young woman must make a difficult choice.\n4. The film explores themes of nature and humanity.\n5. The story is set in a time of great change and upheaval."
    },
    {
        "Film Name": "Joker",
        "Clue": "Here are 5 clues for you to guess the film Joker:\n\n1. The protagonist's life is marked by a profound sense of isolation.\n2. The setting is a city known for its gritty underbelly.\n3. A single, defining event triggers a chain of events.\n4. The protagonist's journey is a descent into madness.\n5. The film explores themes of mental illness and societal injustice. \n\n\nLet me know when you think you have the answer!"
    },
    {
        "Film Name": "Your Name.",
        "Clue": "Here are 5 clues for you to guess \"Your Name\":\n\n1. The film features a unique and visually striking art style.\n2. The story revolves around a powerful connection between two individuals.\n3. The setting of the film is both familiar and fantastical.\n4. The film explores themes of fate and destiny.\n5. The characters experience a profound and transformative journey."
    },
    {
        "Film Name": "High and Low",
        "Clue": "Here are 5 clues for you to guess the film \"High and Low\":\n\n1. The film's central conflict revolves around a complex and dangerous game of power.\n2. A wealthy businessman's life is thrown into chaos by a series of escalating events.\n3. The investigation into the crime takes the protagonist on a journey through the underbelly of society.\n4. The film explores themes of justice, morality, and the consequences of greed.\n5. The film's climax features a dramatic confrontation that leaves the audience breathless."
    },
    {
        "Film Name": "3 Idiots",
        "Clue": "Here are 5 clues for you to guess the film 3 Idiots:\n\n1.  The film explores the pressures of education and societal expectations.\n2.  The story centers around a group of friends navigating their academic and personal lives.\n3.  The film features a unique and memorable portrayal of a college campus.\n4.  The film tackles themes of friendship, loyalty, and personal growth.\n5.  The film's humor is often derived from the characters' unconventional approaches to life."
    },
    {
        "Film Name": "Once Upon a Time in America",
        "Clue": "Here are 5 clues for you to guess \"Once Upon a Time in America\":\n\n1. The film is set in a specific era of American history.\n2. The story revolves around a group of friends and their journey through life.\n3. The film features a complex and intricate plot with multiple storylines.\n4. The film explores themes of loyalty, betrayal, and the passage of time.\n5. The film is known for its epic scope and grand scale."
    },
    {
        "Film Name": "Singin' in the Rain",
        "Clue": "Here are 5 clues for you to guess \"Singin' in the Rain\":\n\n1.  The film features a pivotal moment where a character performs a daring stunt.\n2.  The setting is a time of great technological change and artistic evolution.\n3.  The film's soundtrack is a mix of classic and contemporary music.\n4.  The story revolves around a love triangle with a comedic twist.\n5.  The film is a celebration of the magic and joy of performing."
    },
    {
        "Film Name": "Capernaum",
        "Clue": "Here are 5 clues for you to guess the film *Capernaum*:\n\n1. The film explores themes of justice and societal inequality.\n2. The setting is a bustling city with a complex social structure.\n3. The protagonist's actions are driven by a deep sense of injustice.\n4. The film features a powerful and emotional portrayal of a young person's perspective.\n5. The film's ending leaves a lasting impact on the viewer."
    },
    {
        "Film Name": "Come and See",
        "Clue": "Here are 5 clues for you to guess the film \"Come and See\":\n\n1. The film depicts a brutal and relentless war.\n2. The protagonist experiences a profound loss of innocence.\n3. The film explores the horrors of war through a child's eyes.\n4. The setting is a small, rural village in occupied territory.\n5. The film's ending is both shocking and unforgettable."
    },
    {
        "Film Name": "Requiem for a Dream",
        "Clue": "Here are 5 clues for you to guess \"Requiem for a Dream\":\n\n1. The film explores the destructive nature of addiction.\n2. The setting is a city on the brink of societal collapse.\n3. A desperate pursuit of happiness leads to unforeseen consequences.\n4. The film features a stark contrast between hope and despair.\n5. The characters' lives are intertwined in a complex and tragic web."
    },
    {
        "Film Name": "Toy Story 3",
        "Clue": "Here are 5 clues for you to guess Toy Story 3:\n\n1.  The setting is a place of transition and change.\n2.  A new adventure awaits, but not without its challenges.\n3.  A familiar face is forced to confront their past.\n4.  A journey of self-discovery leads to unexpected consequences.\n5.  The importance of family is tested in a unique way."
    },
    {
        "Film Name": "Star Wars: Episode VI - Return of the Jedi",
        "Clue": "Here are 5 clues for you to guess Star Wars: Episode VI - Return of the Jedi:\n\n1.  The main character faces a difficult choice that will determine the fate of the galaxy.\n2.  A new weapon is introduced that could change the course of the war.\n3.  A beloved character makes a daring escape from captivity.\n4.  A battle takes place on a planet with a unique landscape.\n5.  A powerful symbol of hope is revealed to the galaxy."
    },
    {
        "Film Name": "Eternal Sunshine of the Spotless Mind",
        "Clue": "Here are 5 clues for you to guess \"Eternal Sunshine of the Spotless Mind\":\n\n1.  The film explores the complexities of memory and its impact on relationships.\n2.  A unique and unconventional method is used to erase painful memories.\n3.  The film delves into the themes of love, loss, and the desire to recapture the past.\n4.  The setting is a blend of urban and suburban landscapes.\n5.  The film's narrative structure is non-linear and fragmented. \n\n\nLet me know when you think you have the answer!"
    },
    {
        "Film Name": "The Hunt",
        "Clue": "Here are 5 clues for you to guess the film \"The Hunt\":\n\n1.  The setting is a rural, isolated location.\n2.  A group of people are targeted for a specific reason.\n3.  The film explores themes of social justice and power dynamics.\n4.  The protagonist faces a moral dilemma.\n5.  The film features a tense and suspenseful atmosphere."
    },
    {
        "Film Name": "2001: A Space Odyssey",
        "Clue": "Here are 5 clues for you to guess the film 2001: A Space Odyssey:\n\n1. The film features a powerful, mysterious monolith that appears in multiple locations.\n2. The film explores the vastness and mystery of space.\n3. The film features advanced technology that pushes the boundaries of human understanding.\n4. The film's score is both haunting and awe-inspiring.\n5. The film's ending is both thought-provoking and ambiguous. \n\n\nLet me know when you think you have the answer!"
    },
    {
        "Film Name": "Ikiru",
        "Clue": "Here are 5 clues for you to guess \"Ikiru\":\n\n1. The film's setting is a place of both beauty and decay.\n2. The protagonist's life is defined by a single, powerful moment.\n3. The film explores themes of mortality and the search for meaning.\n4. The protagonist's journey is one of quiet contemplation and personal growth.\n5. The film's ending is both hopeful and melancholic."
    },
    {
        "Film Name": "Reservoir Dogs",
        "Clue": "Here are 5 clues for you to guess Reservoir Dogs:\n\n1. The film opens with a tense, almost silent scene.\n2. A heist goes horribly wrong, leading to a series of escalating events.\n3. The characters are all connected by a shared sense of loyalty and betrayal.\n4. The film's soundtrack is a mix of classic and modern music.\n5. The ending is both shocking and ambiguous."
    },
    {
        "Film Name": "Lawrence of Arabia",
        "Clue": "Here are 5 clues for you to guess \"Lawrence of Arabia\":\n\n1. The film is set in a vast and unforgiving desert landscape.\n2. The protagonist is a complex and enigmatic figure with a strong sense of duty.\n3. The film explores themes of war, politics, and the clash of cultures.\n4. The film features stunning cinematography and breathtaking desert scenery.\n5. The story is based on a true historical figure and his experiences in the Arab Revolt."
    },
    {
        "Film Name": "The Apartment",
        "Clue": "Here are 5 clues for you to guess \"The Apartment\":\n\n1.  The protagonist's apartment is a key part of the story.\n2.  The film explores themes of ambition and social climbing.\n3.  A complex web of relationships is woven throughout the narrative.\n4.  The film features a morally ambiguous protagonist.\n5.  The film's ending is both bittersweet and thought-provoking."
    },
    {
        "Film Name": "Incendies",
        "Clue": "Here are 5 clues for you to guess the film *Incendies*:\n\n1. The film explores the complexities of family secrets and their impact on personal identity.\n2. The story unfolds across two distinct locations, each with its own unique cultural and historical context.\n3. The film delves into the themes of war, displacement, and the search for truth.\n4. The narrative structure is unconventional, employing flashbacks and parallel storylines.\n5. The film's ending is both powerful and ambiguous, leaving the audience to contemplate its meaning."
    },
    {
        "Film Name": "Oppenheimer",
        "Clue": "Here are 5 clues for you to guess the film Oppenheimer:\n\n1. The film explores the complex ethical dilemmas of scientific advancement.\n2. The setting is a time of intense political and social change.\n3. The story delves into the personal struggles of a brilliant scientist.\n4. The film features a pivotal moment in history with global implications.\n5. The film's themes are both personal and universal."
    },
    {
        "Film Name": "North by Northwest",
        "Clue": "Here are 5 clues for you to guess \"North by Northwest\":\n\n1.  The protagonist is mistaken for someone else and gets caught up in a dangerous game of espionage.\n2.  The setting involves a vast, open landscape with a strong sense of isolation.\n3.  A famous, iconic symbol is used as a key plot device.\n4.  The protagonist's pursuit involves a thrilling chase through various locations.\n5.  The film features a memorable and suspenseful climax."
    },
    {
        "Film Name": "Scarface",
        "Clue": "Here are 5 clues for you to guess \"Scarface\":\n\n1.  The protagonist's rise to power is fueled by a ruthless ambition.\n2.  The film features a lavish lifestyle built on illegal activities.\n3.  The setting is a vibrant and dangerous city.\n4.  The protagonist's downfall is a consequence of his own actions.\n5.  The film explores themes of greed, power, and corruption."
    },
    {
        "Film Name": "Citizen Kane",
        "Clue": "Here are 5 clues for you to guess Citizen Kane:\n\n1. The film is known for its innovative use of cinematography.\n2. The story is told in a non-linear fashion.\n3. The film explores themes of wealth, power, and legacy.\n4. The protagonist's life is marked by both success and tragedy.\n5. The film's ending is both ambiguous and thought-provoking."
    },
    {
        "Film Name": "Double Indemnity",
        "Clue": "Here are 5 clues for you to guess \"Double Indemnity\":\n\n1.  The film's central plot revolves around a complex insurance scheme.\n2.  A seemingly innocent relationship masks a dangerous secret.\n3.  The protagonist's actions are driven by a desire for financial gain.\n4.  The film explores themes of deception and betrayal.\n5.  The setting is a time period known for its societal norms and moral ambiguity."
    },
    {
        "Film Name": "M",
        "Clue": "1. The film is set in a world where technology has advanced beyond our wildest dreams.\n2. The protagonist faces a moral dilemma that forces them to question their beliefs.\n3. The film explores the complexities of human relationships and the power of love.\n4. The setting is both beautiful and dangerous, with a sense of mystery and intrigue.\n5. The film's ending is both satisfying and thought-provoking."
    },
    {
        "Film Name": "Vertigo",
        "Clue": "Here are 5 clues for you to guess the film *Vertigo*:\n\n1. The protagonist is a private investigator with a troubled past.\n2. The setting is a city known for its beautiful architecture and dark secrets.\n3. The film features a complex and ambiguous love story.\n4. The protagonist's actions are driven by a desire for revenge and redemption.\n5. The film explores themes of obsession, memory, and identity."
    },
    {
        "Film Name": "Full Metal Jacket",
        "Clue": "Here are 5 clues for you to guess \"Full Metal Jacket\":\n\n1.  The film depicts a brutal and dehumanizing training process.\n2.  The setting is a war-torn, chaotic environment.\n3.  The protagonist undergoes a significant transformation throughout the story.\n4.  The film explores themes of violence, trauma, and the nature of war.\n5.  The film's ending is both shocking and thought-provoking."
    },
    {
        "Film Name": "AmÃ©lie",
        "Clue": "Here are 5 clues for you to guess the film *Amélie*:\n\n1. The film is set in a charming, bustling city.\n2. The protagonist has a unique and whimsical outlook on life.\n3. A central theme revolves around the power of kindness and connection.\n4. The film features a memorable and visually striking soundtrack.\n5. The story explores themes of loneliness and the search for meaning."
    },
    {
        "Film Name": "Heat",
        "Clue": "Here are 5 clues for you to guess the film *Heat*:\n\n1.  The film features a tense cat-and-mouse chase between two skilled professionals.\n2.  The setting is a city known for its bustling energy and diverse population.\n3.  The film explores the complexities of law enforcement and criminal activity.\n4.  The protagonist is driven by a deep sense of justice and a desire for redemption.\n5.  The film's climax is a high-stakes showdown that leaves viewers on the edge of their seats."
    },
    {
        "Film Name": "Up",
        "Clue": "Here are 5 clues for you to guess the film Up:\n\n1.  The protagonist carries a heavy, symbolic object.\n2.  The setting features a vast wilderness and breathtaking landscapes.\n3.  The journey involves overcoming significant obstacles and challenges.\n4.  A heartwarming bond forms between two unlikely companions.\n5.  The film explores themes of love, loss, and the importance of memories."
    },
    {
        "Film Name": "A Clockwork Orange",
        "Clue": "Here are 5 clues for you to guess \"A Clockwork Orange\":\n\n1.  The film explores the nature of free will and the consequences of unchecked desires.\n2.  The protagonist's actions are often shocking and disturbing to those around him.\n3.  The film features a unique and memorable soundtrack.\n4.  The setting is a dystopian future with a distinct visual style.\n5.  The film's themes are often debated and analyzed by critics and audiences alike."
    },
    {
        "Film Name": "To Kill a Mockingbird",
        "Clue": "Here are 5 clues for you to guess \"To Kill a Mockingbird\":\n\n1. The story takes place in a small Southern town.\n2. A young girl witnesses a shocking event that changes her perspective.\n3. The main character learns about prejudice and injustice.\n4. The story explores themes of childhood innocence and moral courage.\n5. The setting is deeply rooted in the social and political climate of the time."
    },
    {
        "Film Name": "A Separation",
        "Clue": "Here are 5 clues for you to guess the film \"A Separation\":\n\n1. The film explores themes of societal expectations and personal responsibility.\n2. A central conflict arises from a difficult family decision.\n3. The setting is a bustling, modern city.\n4. The film delves into the complexities of human relationships.\n5. The story is driven by a pivotal moment of truth."
    },
    {
        "Film Name": "The Sting",
        "Clue": "Here are 5 clues for you to guess \"The Sting\":\n\n1.  The film features a con artist who uses deception to outsmart his opponents.\n2.  The setting is a time of great social and economic change.\n3.  The film explores themes of loyalty, betrayal, and redemption.\n4.  The film's score is a blend of classic jazz and contemporary music.\n5.  The film's climax involves a high-stakes gamble with life-altering consequences."
    },
    {
        "Film Name": "Die Hard",
        "Clue": "Here are 5 clues for you to guess \"Die Hard\":\n\n1. The main character is a skilled and resourceful individual.\n2. The setting is a high-rise building.\n3. A tense and action-packed atmosphere is prevalent.\n4. A bomb threat creates a sense of urgency.\n5. The protagonist faces off against a group of antagonists."
    },
    {
        "Film Name": "Indiana Jones and the Last Crusade",
        "Clue": "Here are 5 clues for you to guess \"Indiana Jones and the Last Crusade\":\n\n1. The protagonist faces a perilous journey across a vast and dangerous landscape.\n2. A hidden artifact holds the key to a powerful and ancient secret.\n3. The pursuit of the artifact leads to a clash of ideologies and beliefs.\n4. A daring escape from a perilous situation is a defining moment in the story.\n5. The journey tests the bonds of family and the strength of character."
    },
    {
        "Film Name": "Like Stars on Earth",
        "Clue": "Here are 5 clues for you to guess the film \"Like Stars on Earth\":\n\n1. The film explores themes of love, loss, and the complexities of human relationships.\n2. The setting is a vibrant and bustling city, filled with both beauty and hardship.\n3. The story centers around a pivotal moment in a character's life, leading to significant change.\n4. The film features a strong sense of realism and emotional depth.\n5. The narrative is told through a combination of intimate moments and broader societal observations."
    },
    {
        "Film Name": "Metropolis",
        "Clue": "Here are 5 clues for you to guess the film Metropolis:\n\n1.  The film is set in a futuristic city divided by class.\n2.  A powerful machine controls the city's energy and resources.\n3.  A worker falls in love with a woman from a higher social class.\n4.  The film explores themes of technology, social inequality, and love.\n5.  The film features a striking visual style with iconic imagery."
    },
    {
        "Film Name": "Snatch",
        "Clue": "Here are 5 clues for you to guess the film Snatch:\n\n1. The film features a tense and chaotic scene involving a stolen diamond.\n2. A character's love for a particular type of food is a key part of their personality.\n3. A character's past actions have a significant impact on their present life.\n4. The film explores themes of loyalty and betrayal in a high-stakes environment.\n5. A memorable scene involves a dramatic confrontation in a crowded location."
    },
    {
        "Film Name": "1917",
        "Clue": "Here are 5 clues for you to guess the film \"1917\":\n\n1. The film is set during a time of intense global conflict.\n2. The story follows a single mission with a high stakes outcome.\n3. The film utilizes innovative cinematography techniques.\n4. The film's setting is a war-torn landscape.\n5. The film's narrative is driven by a sense of urgency and danger."
    },
    {
        "Film Name": "L.A. Confidential",
        "Clue": "Here are 5 clues for you to guess \"L.A. Confidential\":\n\n1. The film takes place in a city known for its glamour and corruption.\n2. A murder investigation leads to a tangled web of secrets and lies.\n3. The story explores themes of power, ambition, and the dark side of Hollywood.\n4. The film features a complex and morally ambiguous protagonist.\n5. The setting is a time of significant social and political change."
    },
    {
        "Film Name": "Bicycle Thieves",
        "Clue": "Here are 5 clues for you to guess \"Bicycle Thieves\":\n\n1. The film's setting is a time of great social and economic change.\n2. The protagonist's primary goal is to provide for his family.\n3. The film explores themes of poverty and desperation.\n4. The film's cinematography is known for its realism and gritty style.\n5. The film's ending is both hopeful and tragic."
    },
    {
        "Film Name": "Hamilton",
        "Clue": "Here are 5 clues for you to guess the film Hamilton:\n\n1. The story is set in a specific historical period.\n2. The film features a large ensemble cast.\n3. The music is a blend of genres, including pop, hip-hop, and R&B.\n4. The film explores themes of ambition, legacy, and revolution.\n5. The film is a musical adaptation of a biographical play. \n\n\nLet me know when you think you have the answer!"
    },
    {
        "Film Name": "Taxi Driver",
        "Clue": "Here are 5 clues for you to guess Taxi Driver:\n\n1. The protagonist's primary mode of transportation is a cab.\n2. The film explores themes of isolation and alienation.\n3. The city serves as a character in the film, both beautiful and menacing.\n4. The protagonist's actions are often impulsive and driven by anger.\n5. The film's ending is both ambiguous and unsettling."
    },
    {
        "Film Name": "Downfall",
        "Clue": "Here are 5 clues for you to guess the film \"Downfall\":\n\n1. The setting is a small, confined space.\n2. The protagonist is consumed by his own thoughts and actions.\n3. The film explores themes of power and its consequences.\n4. The atmosphere is tense and claustrophobic.\n5. The ending is both tragic and thought-provoking."
    },
    {
        "Film Name": "Dangal",
        "Clue": "Here are 5 clues for you to guess the film \"Dangal\":\n\n1. The film is set in a rural Indian village.\n2. The main character faces a significant challenge in pursuing their dreams.\n3. The film explores the power of family and tradition.\n4. The story is a testament to the strength of women.\n5. The film is a celebration of Indian culture and heritage."
    },
    {
        "Film Name": "Batman Begins",
        "Clue": "Here are 5 clues for you to guess \"Batman Begins\":\n\n1.  The protagonist begins his journey with a deep sense of loss and a desire for justice.\n2.  A mysterious organization plays a significant role in the film's plot.\n3.  The protagonist undergoes a physical and mental transformation.\n4.  The film explores the themes of fear and control.\n5.  The setting is a city shrouded in darkness and corruption."
    },
    {
        "Film Name": "For a Few Dollars More",
        "Clue": "Here are 5 clues for you to guess \"For a Few Dollars More\":\n\n1.  The film features a tense standoff in a dusty, desolate landscape.\n2.  A skilled gambler is hired for a dangerous job with a hefty reward.\n3.  A mysterious figure with a hidden agenda plays a crucial role.\n4.  The film explores themes of loyalty, betrayal, and the pursuit of justice.\n5.  The story takes place in a time of political unrest and shifting alliances."
    },
    {
        "Film Name": "The Wolf of Wall Street",
        "Clue": "Here are 5 clues for you to guess \"The Wolf of Wall Street\":\n\n1.  The film features a lavish lifestyle fueled by excess.\n2.  The protagonist's ambition leads him down a path of questionable morality.\n3.  The film explores themes of wealth, power, and the pursuit of pleasure.\n4.  The protagonist's actions have significant consequences for those around him.\n5.  The film is known for its fast-paced, comedic style."
    },
    {
        "Film Name": "Green Book",
        "Clue": "Here are 5 clues for you to guess the film \"Green Book\":\n\n1. The film takes place in the 1960s.\n2. The story involves a complex relationship between two very different men.\n3. The setting is a time of significant social and racial tension.\n4. The film explores themes of friendship and understanding.\n5. The journey is filled with both beauty and hardship."
    },
    {
        "Film Name": "Some Like It Hot",
        "Clue": "Here are 5 clues for you to guess \"Some Like It Hot\":\n\n1.  The film features a comedic misunderstanding involving a group of people.\n2.  The setting is a time of social upheaval and change.\n3.  The plot involves disguises and a desire for a fresh start.\n4.  The film is known for its witty dialogue and slapstick humor.\n5.  The film explores themes of gender identity and societal expectations."
    },
    {
        "Film Name": "The Kid",
        "Clue": "Here are 5 clues for you to guess \"The Kid\":\n\n1. The film features a young boy who is both mischievous and innocent.\n2. The setting is a bustling city, but the story is set against a backdrop of poverty.\n3. The protagonist's relationship with the boy is complex and evolving.\n4. The film explores themes of love, loss, and the challenges of adulthood.\n5. The film's ending is both bittersweet and hopeful."
    },
    {
        "Film Name": "Judgment at Nuremberg",
        "Clue": "Here are 5 clues for you to guess the film \"Judgment at Nuremberg\":\n\n1. The film explores the complexities of justice and morality in a post-war world.\n2. The setting is a courtroom, where a trial unfolds under intense scrutiny.\n3. The film delves into the ethical dilemmas faced by individuals in a system of law.\n4. The film examines the impact of historical events on individual lives.\n5. The film raises questions about the nature of truth and the limits of human judgment."
    },
    {
        "Film Name": "The Father",
        "Clue": "Here are 5 clues for you to guess \"The Father\":\n\n1. The film explores the complexities of memory and reality.\n2. The setting is a familiar yet increasingly isolating space.\n3. A central theme revolves around the struggle for independence.\n4. The protagonist's perception of the world shifts dramatically.\n5. The film delves into the emotional impact of aging and dementia."
    },
    {
        "Film Name": "The Truman Show",
        "Clue": "Here are 5 clues for you to guess \"The Truman Show\":\n\n1. The protagonist's life is meticulously controlled and monitored.\n2. A hidden camera crew observes every aspect of his existence.\n3. The protagonist's world is a carefully constructed illusion.\n4. The protagonist's journey involves a quest for freedom and truth.\n5. The film explores themes of reality, perception, and the nature of truth."
    },
    {
        "Film Name": "All About Eve",
        "Clue": "Here are 5 clues for you to guess \"All About Eve\":\n\n1.  The film explores the complexities of ambition and its impact on relationships.\n2.  A backstage world of theater and its secrets is the setting.\n3.  The pursuit of fame and recognition drives the central conflict.\n4.  A mentor-mentee dynamic is at the heart of the story.\n5.  The film delves into the nature of truth and perception."
    },
    {
        "Film Name": "Shutter Island",
        "Clue": "Here are 5 clues for you to guess Shutter Island:\n\n1. The setting is a place of both beauty and isolation.\n2. A key element of the story is a struggle against the unknown.\n3. The protagonist's mental state is a central theme.\n4. The film explores the nature of truth and perception.\n5. The ending is both shocking and thought-provoking."
    },
    {
        "Film Name": "There Will Be Blood",
        "Clue": "Here are 5 clues for you to guess \"There Will Be Blood\":\n\n1. The film is set in the late 19th century.\n2. The protagonist's ambition is fueled by a relentless pursuit of wealth.\n3. The setting is a harsh and unforgiving landscape.\n4. The film explores themes of greed and the corrupting influence of power.\n5. The protagonist's actions have a profound impact on the lives of those around him."
    },
    {
        "Film Name": "Top Gun: Maverick",
        "Clue": "Here are 5 clues for you to guess Top Gun: Maverick:\n\n1. The film features a thrilling aerial dogfight sequence.\n2. The protagonist is a skilled pilot facing a personal challenge.\n3. The film takes place in a high-stakes environment.\n4. The protagonist's past experiences influence his present actions.\n5. The film explores themes of legacy and mentorship."
    },
    {
        "Film Name": "Jurassic Park",
        "Clue": "1.  A scientist's dream becomes a nightmare.\n2.  A remote island holds a secret that could change the world.\n3.  Dinosaurs are brought back to life, but not without consequences.\n4.  A thrilling chase through a jungle sets the stage for a desperate fight for survival.\n5.  The line between science and nature is blurred in this groundbreaking film."
    },
    {
        "Film Name": "Casino",
        "Clue": "Here are 5 clues for you to guess the film Casino:\n\n1.  The film takes place in a glamorous yet dangerous world.\n2.  The protagonist's life is intertwined with a high-stakes game.\n3.  The film explores themes of loyalty, betrayal, and ambition.\n4.  The setting is a city known for its excess and vice.\n5.  The film features a complex and morally ambiguous protagonist."
    },
    {
        "Film Name": "Ran",
        "Clue": "Here are 5 clues for you to guess the film \"Ran\":\n\n1. The film is set in a vast and opulent palace.\n2. The story revolves around a complex power struggle.\n3. The film features a dramatic battle scene.\n4. The film explores themes of love, betrayal, and revenge.\n5. The film is a visually stunning and epic production."
    },
    {
        "Film Name": "The Sixth Sense",
        "Clue": "Here are 5 clues for you to guess \"The Sixth Sense\":\n\n1.  The protagonist experiences a unique and unsettling connection to a specific object.\n2.  The film's central mystery revolves around a seemingly impossible event.\n3.  The protagonist's journey involves confronting a profound and personal truth.\n4.  The film utilizes a specific visual motif to enhance its unsettling atmosphere.\n5.  The film's ending is both shocking and emotionally resonant."
    },
    {
        "Film Name": "Pan's Labyrinth",
        "Clue": "Here are 5 clues for you to guess Pan's Labyrinth:\n\n1. The film is set during a time of political turmoil and oppression.\n2. A young girl finds solace in a fantastical world.\n3. The film explores themes of innocence and darkness.\n4. A magical creature plays a significant role in the story.\n5. The film's visuals are both beautiful and unsettling."
    },
    {
        "Film Name": "Unforgiven",
        "Clue": "Here are 5 clues for you to guess \"Unforgiven\":\n\n1. The film's setting is a harsh and unforgiving landscape.\n2. The protagonist grapples with a past filled with violence and regret.\n3. The film explores themes of redemption and the consequences of actions.\n4. A pivotal moment involves a confrontation with a powerful figure.\n5. The film's ending is both poignant and ambiguous."
    },
    {
        "Film Name": "No Country for Old Men",
        "Clue": "Here are 5 clues for you to guess \"No Country for Old Men\":\n\n1. The film features a tense, atmospheric landscape.\n2. A deadly game of cat and mouse unfolds.\n3. A simple act of kindness can have unexpected consequences.\n4. The protagonist grapples with the changing nature of society.\n5. The film explores the themes of fate and morality."
    },
    {
        "Film Name": "The Thing",
        "Clue": "Here are 5 clues for you to guess \"The Thing\":\n\n1. The film features a chilling transformation that can be both terrifying and fascinating.\n2. The setting is a remote research outpost in a harsh and unforgiving environment.\n3. The threat is not easily identified, making it a constant source of paranoia and suspicion.\n4. The film explores the nature of trust and betrayal in the face of an unknown enemy.\n5. The film's atmosphere is thick with tension and dread, leaving the audience on edge."
    },
    {
        "Film Name": "A Beautiful Mind",
        "Clue": "Here are 5 clues for you to guess \"A Beautiful Mind\":\n\n1. The film explores a complex and challenging mental illness.\n2. The protagonist's work involves a field of study that is both fascinating and controversial.\n3. The film features a pivotal event that changes the protagonist's life forever.\n4. The film's setting is a place of intellectual pursuit and academic rigor.\n5. The film's message is one of resilience and the power of the human spirit."
    },
    {
        "Film Name": "Kill Bill: Vol. 1",
        "Clue": "Here are 5 clues for you to guess \"Kill Bill: Vol. 1\":\n\n1. The film features a stylized, martial arts-driven fight scene.\n2. A woman seeks revenge for a betrayal that left her scarred.\n3. The film's soundtrack is a blend of classic and modern music.\n4. The protagonist is a skilled assassin with a unique fighting style.\n5. The film is a blend of action, revenge, and a touch of humor. \n\n\nLet me know when you think you have it!"
    },
    {
        "Film Name": "The Treasure of the Sierra Madre",
        "Clue": "Here are 5 clues for you to guess \"The Treasure of the Sierra Madre\":\n\n1.  The journey to the treasure is fraught with danger and moral ambiguity.\n2.  The pursuit of wealth leads to a desperate struggle for survival.\n3.  The setting is a harsh and unforgiving landscape.\n4.  The characters are driven by greed and a thirst for something more.\n5.  The film explores the complexities of human nature in the face of temptation."
    },
    {
        "Film Name": "Yojimbo",
        "Clue": "Here are 5 clues for you to guess Yojimbo:\n\n1. The film features a lone samurai wandering through a bustling town.\n2. The protagonist uses his wits and skills to manipulate the local gangs.\n3. The setting is a place of both beauty and danger.\n4. The film explores themes of honor and justice.\n5. The protagonist's ultimate goal is to bring peace to the town."
    },
    {
        "Film Name": "The Great Escape",
        "Clue": "Here are 5 clues for you to guess \"The Great Escape\":\n\n1.  The film takes place during a specific historical event.\n2.  The main characters are desperate to escape a confined location.\n3.  The escape plan involves a daring and risky maneuver.\n4.  The film features a tense and suspenseful atmosphere.\n5.  The escape attempt has significant consequences for the characters involved."
    },
    {
        "Film Name": "Monty Python and the Holy Grail",
        "Clue": "Here are 5 clues for you to guess Monty Python and the Holy Grail:\n\n1.  A quest for a magical object leads to absurd situations.\n2.  A group of people are tasked with a seemingly impossible task.\n3.  A comedic battle ensues with a group of knights.\n4.  A ridiculous and unexpected character appears in a crucial moment.\n5.  A famous phrase is used to describe a situation. \n\n\nLet me know when you think you have the answer!"
    },
    {
        "Film Name": "Finding Nemo",
        "Clue": "Here are 5 clues for you to guess Finding Nemo:\n\n1.  The film features a vibrant underwater world.\n2.  A clownfish embarks on a perilous journey.\n3.  A dentist plays a significant role in the story.\n4.  The protagonist faces numerous challenges and obstacles.\n5.  The film explores themes of family and resilience."
    },
    {
        "Film Name": "Prisoners",
        "Clue": "Here are 5 clues for you to guess the film \"Prisoners\":\n\n1. The film explores the dark side of a small town.\n2. A desperate father will go to any lengths to find his missing daughter.\n3. The investigation leads to a web of secrets and lies.\n4. The film features a tense and suspenseful atmosphere.\n5. The ending leaves a lasting impact on the viewer."
    },
    {
        "Film Name": "Howl's Moving Castle",
        "Clue": "Here are 5 clues for you to guess \"Howl's Moving Castle\":\n\n1.  The protagonist is cursed with an unusual appearance.\n2.  The setting is a fantastical world with magical elements.\n3.  A powerful witch plays a significant role in the story.\n4.  The film explores themes of love, self-discovery, and sacrifice.\n5.  The journey involves a quest for freedom and self-acceptance."
    },
    {
        "Film Name": "Rashomon",
        "Clue": "Here are 5 clues for you to guess the film *Rashomon*:\n\n1. The film explores the subjective nature of truth.\n2. The story unfolds through multiple perspectives.\n3. The setting is a Japanese village.\n4. The film uses a unique narrative structure.\n5. The film is known for its ambiguity and open-endedness."
    },
    {
        "Film Name": "The Elephant Man",
        "Clue": "Here are 5 clues for you to guess \"The Elephant Man\":\n\n1. The film explores themes of societal prejudice and compassion.\n2. The setting is a time of great social change and medical advancement.\n3. The protagonist's physical appearance is a source of both fascination and fear.\n4. The film features a complex relationship between a doctor and a patient.\n5. The film's ending is both hopeful and tragic."
    },
    {
        "Film Name": "Dial M for Murder",
        "Clue": "Here are 5 clues for you to guess \"Dial M for Murder\":\n\n1. The film revolves around a carefully planned act of deception.\n2. A seemingly innocent act of kindness masks a sinister motive.\n3. The setting is a world of wealth and privilege, but secrets lurk beneath the surface.\n4. The protagonist's actions are driven by a desperate desire for revenge.\n5. The film explores the complexities of love, betrayal, and the lengths people will go to for their own desires. \n\n\nLet me know when you think you have the answer!"
    },
    {
        "Film Name": "Chinatown",
        "Clue": "Here are 5 clues for you to guess the film *Chinatown*:\n\n1. The film is set in a city known for its sprawling infrastructure and hidden secrets.\n2. A seemingly simple case of missing water rights quickly spirals into a complex web of deceit.\n3. The protagonist is a man driven by ambition and a thirst for power.\n4. The film features a pivotal scene involving a mysterious and dangerous figure.\n5. The film's ending is both shocking and thought-provoking."
    },
    {
        "Film Name": "Gone with the Wind",
        "Clue": "Here are 5 clues for you to guess \"Gone with the Wind\":\n\n1. The story takes place during a time of great societal change.\n2. The main character experiences both immense wealth and profound loss.\n3. The film features a sweeping landscape that is both beautiful and harsh.\n4. The protagonist's journey is marked by both love and betrayal.\n5. The film explores themes of resilience and the enduring power of the human spirit."
    },
    {
        "Film Name": "Lock, Stock and Two Smoking Barrels",
        "Clue": "Here are 5 clues for you to guess \"Lock, Stock and Two Smoking Barrels\":\n\n1.  The film features a tense game of chance with high stakes.\n2.  A character's life is turned upside down by a sudden inheritance.\n3.  The setting is a world of organized crime and shady dealings.\n4.  A seemingly simple heist goes awry, leading to unexpected consequences.\n5.  The film explores themes of friendship, betrayal, and the pursuit of wealth."
    },
    {
        "Film Name": "V for Vendetta",
        "Clue": "Here are 5 clues for you to guess \"V for Vendetta\":\n\n1. The film features a powerful symbol of rebellion.\n2. The protagonist's actions are driven by a desire for justice.\n3. The setting is a dystopian future with strict societal control.\n4. The film explores themes of freedom and oppression.\n5. The protagonist's methods are often unconventional and violent."
    },
    {
        "Film Name": "The Secret in Their Eyes",
        "Clue": "Here are 5 clues for you to guess \"The Secret in Their Eyes\":\n\n1. The film is set in a specific time period.\n2. The story revolves around a complex legal case.\n3. The protagonist grapples with a past trauma.\n4. The film explores themes of justice and revenge.\n5. The ending is both satisfying and thought-provoking."
    },
    {
        "Film Name": "Inside Out",
        "Clue": "Here are 5 clues for you to guess the film Inside Out:\n\n1.  The film explores the complex emotions of a young girl.\n2.  The protagonist's emotions are personified and have distinct personalities.\n3.  The film uses a unique visual style to represent different emotions.\n4.  The story takes place within the mind of a young person.\n5.  The film tackles themes of growth and change."
    },
    {
        "Film Name": "Raging Bull",
        "Clue": "Here are 5 clues for you to guess \"Raging Bull\":\n\n1.  The film features a dramatic portrayal of a man's physical and emotional transformation.\n2.  The setting is a world of intense competition and personal struggle.\n3.  The film explores themes of violence, redemption, and the pursuit of perfection.\n4.  The protagonist's actions are often impulsive and driven by raw emotion.\n5.  The film is known for its powerful use of close-up shots and visceral imagery."
    },
    {
        "Film Name": "Three Billboards Outside Ebbing, Missouri",
        "Clue": "Here are five clues for you to guess the film \"Three Billboards Outside Ebbing, Missouri\":\n\n1. The film explores themes of grief and justice.\n2. The setting is a small, rural town grappling with a local tragedy.\n3. A billboard serves as a focal point for the story's central conflict.\n4. The film features a complex and morally ambiguous protagonist.\n5. The film's ending is both impactful and thought-provoking."
    },
    {
        "Film Name": "Trainspotting",
        "Clue": "Here are 5 clues for you to guess \"Trainspotting\":\n\n1.  The film features a gritty portrayal of urban life.\n2.  The main character struggles with addiction and its consequences.\n3.  The film explores themes of friendship and betrayal.\n4.  The setting is a city known for its drug culture.\n5.  The film is known for its dark humor and unflinching realism."
    },
    {
        "Film Name": "The Bridge on the River Kwai",
        "Clue": "Here are 5 clues for you to guess \"The Bridge on the River Kwai\":\n\n1.  The setting is a place of both beauty and danger.\n2.  A complex game of strategy and power is at play.\n3.  The film explores the themes of duty and sacrifice.\n4.  The protagonist's actions have far-reaching consequences.\n5.  The film's ending is both powerful and thought-provoking."
    },
    {
        "Film Name": "Klaus",
        "Clue": "Here are 5 clues for you to guess the film Klaus:\n\n1. The film features a heartwarming journey of self-discovery.\n2. The setting is a remote and magical place.\n3. The protagonist is a kind and gentle soul.\n4. The film explores themes of friendship and kindness.\n5. The film is a visually stunning and imaginative experience."
    },
    {
        "Film Name": "Catch Me If You Can",
        "Clue": "Here are 5 clues for you to guess \"Catch Me If You Can\":\n\n1. The protagonist is a master of disguise.\n2. The film features a thrilling chase across the globe.\n3. The story involves a complex web of lies and deception.\n4. The film explores themes of identity and freedom.\n5. The protagonist's actions have significant consequences for those around him."
    },
    {
        "Film Name": "Fargo",
        "Clue": "Here are 5 clues for you to guess the film Fargo:\n\n1. The film takes place in a rural Midwestern state.\n2. A body is found in a field, covered in snow.\n3. A tense standoff occurs in a diner.\n4. A character's life is turned upside down by a sudden event.\n5. The film explores themes of loyalty, betrayal, and the pursuit of money."
    },
    {
        "Film Name": "Warrior",
        "Clue": "Here are 5 clues for you to guess the film \"Warrior\":\n\n1. The film features a tense and brutal fight for survival.\n2. The setting is a world of grit and hardship.\n3. The protagonist grapples with a difficult past.\n4. The film explores themes of family and redemption.\n5. The story is driven by a powerful sense of loyalty."
    },
    {
        "Film Name": "Spider-Man: No Way Home",
        "Clue": "Here are 5 clues for you to guess \"Spider-Man: No Way Home\":\n\n1.  The film features a complex and multi-layered plot with unexpected twists.\n2.  The protagonist faces a moral dilemma that forces them to question their identity.\n3.  The film explores the consequences of seeking help from outside sources.\n4.  The setting of the film is both familiar and fantastical.\n5.  The film's climax involves a high-stakes battle for the fate of the world."
    },
    {
        "Film Name": "Gran Torino",
        "Clue": "Here are 5 clues for you to guess \"Gran Torino\":\n\n1. The protagonist is a man who has seen a lot of life.\n2. The setting is a quiet, suburban neighborhood.\n3. The protagonist's past is a source of conflict.\n4. The protagonist's actions have unexpected consequences.\n5. The film explores themes of family and redemption."
    },
    {
        "Film Name": "Harry Potter and the Deathly Hallows: Part 2",
        "Clue": "Here are 5 clues for you to guess \"Harry Potter and the Deathly Hallows: Part 2\":\n\n1. The final battle takes place in a place of great significance to the wizarding world.\n2. A powerful object is used to protect the wizarding world from a great evil.\n3. A sacrifice is made to ensure the survival of the wizarding world.\n4. A journey of self-discovery leads to a final confrontation.\n5. The fate of the wizarding world hangs in the balance."
    },
    {
        "Film Name": "Million Dollar Baby",
        "Clue": "Here are 5 clues for you to guess \"Million Dollar Baby\":\n\n1.  The film features a grueling training regimen.\n2.  The protagonist's dream is to achieve a specific level of success.\n3.  The film explores themes of ambition and sacrifice.\n4.  The setting is a world of intense competition and pressure.\n5.  The film's ending is both hopeful and bittersweet."
    },
    {
        "Film Name": "My Neighbour Totoro",
        "Clue": "Here are 5 clues for you to guess \"My Neighbor Totoro\":\n\n1. The film features a magical creature that lives in the forest.\n2. The story takes place in a rural Japanese village.\n3. The protagonist's family experiences a period of change and growth.\n4. The film is known for its whimsical and heartwarming atmosphere.\n5. The film explores themes of childhood wonder and imagination."
    },
    {
        "Film Name": "Mad Max: Fury Road",
        "Clue": "Here are 5 clues for you to guess \"Mad Max: Fury Road\":\n\n1.  The setting is a desolate and unforgiving landscape.\n2.  A group of rebels fights for their freedom against a tyrannical regime.\n3.  A powerful and dangerous vehicle plays a crucial role in the story.\n4.  The film features a unique and visually stunning aesthetic.\n5.  The film is known for its intense action sequences and high-octane thrills."
    },
    {
        "Film Name": "Children of Heaven",
        "Clue": "Here are 5 clues for you to guess the film \"Children of Heaven\":\n\n1. The film is set in a country with a strong religious influence.\n2. The main characters rely on simple, everyday objects for their survival.\n3. The film explores themes of poverty and resilience.\n4. The setting is a bustling marketplace filled with vibrant colors and sounds.\n5. The film's message is one of hope and the power of human connection."
    },
    {
        "Film Name": "12 Years a Slave",
        "Clue": "Here are 5 clues for you to guess the film \"12 Years a Slave\":\n\n1. The film depicts a brutal and unforgiving system of slavery.\n2. The story is set in the antebellum South of the United States.\n3. The protagonist experiences immense physical and emotional hardship.\n4. The film explores themes of resilience and the fight for freedom.\n5. The film's ending is both hopeful and heartbreaking."
    },
    {
        "Film Name": "Ben-Hur",
        "Clue": "Here are 5 clues for you to guess the film Ben-Hur:\n\n1.  The film features a chariot race as a central plot point.\n2.  The story takes place in ancient times.\n3.  The film explores themes of betrayal and revenge.\n4.  The protagonist is a Jewish man living in Roman-occupied Judea.\n5.  The film is known for its epic scale and visual effects."
    },
    {
        "Film Name": "Before Sunrise",
        "Clue": "Here are 5 clues for you to guess the film \"Before Sunrise\":\n\n1. The film takes place over a single day.\n2. The characters are strangers who meet on a train.\n3. The setting is a European city.\n4. The film focuses on a conversation between two people.\n5. The film explores themes of love and connection."
    },
    {
        "Film Name": "Barry Lyndon",
        "Clue": "Here are 5 clues for you to guess \"Barry Lyndon\":\n\n1. The film is set in a specific historical period.\n2. The protagonist's ambition is fueled by a desire for wealth and status.\n3. The film features lavish and opulent settings.\n4. The protagonist's journey is marked by both love and betrayal.\n5. The film's cinematography is renowned for its use of light and shadow."
    },
    {
        "Film Name": "Blade Runner",
        "Clue": "Here are 5 clues for you to guess the film Blade Runner:\n\n1. The film explores the nature of humanity and what it means to be alive.\n2. The setting is a dystopian future with advanced technology.\n3. The protagonist grapples with his own identity and purpose.\n4. The film features a complex and morally ambiguous story.\n5. The film's visual style is iconic and memorable."
    },
    {
        "Film Name": "The Grand Budapest Hotel",
        "Clue": "Here are 5 clues for you to guess \"The Grand Budapest Hotel\":\n\n1. The film features a lavish, yet decaying, European hotel.\n2. The protagonist is a charming, yet eccentric, concierge.\n3. The story involves a complex web of secrets and lies.\n4. The film is known for its vibrant, stylized visuals.\n5. The film explores themes of loyalty, friendship, and loss."
    },
    {
        "Film Name": "Hacksaw Ridge",
        "Clue": "Here are 5 clues for you to guess the film \"Hacksaw Ridge\":\n\n1. The film depicts a pivotal moment in American history.\n2. The protagonist's actions are driven by strong religious beliefs.\n3. The film features a unique and unconventional form of warfare.\n4. The setting is a time of intense conflict and moral dilemmas.\n5. The film explores themes of courage, sacrifice, and redemption."
    },
    {
        "Film Name": "Gone Girl",
        "Clue": "Here are 5 clues for you to guess \"Gone Girl\":\n\n1. The story is told from multiple perspectives.\n2. A seemingly perfect marriage takes a dark turn.\n3. A missing person case becomes a media frenzy.\n4. The truth is often hidden behind carefully constructed facades.\n5. The line between reality and perception blurs."
    },
    {
        "Film Name": "Dead Poets Society",
        "Clue": "Here are 5 clues for you to guess \"Dead Poets Society\":\n\n1.  The film explores the power of education and self-discovery.\n2.  A strict and demanding teacher inspires his students to embrace their individuality.\n3.  The setting is a prestigious boarding school in the 1950s.\n4.  The film features a memorable scene of students reciting poetry in a unique way.\n5.  The film's message encourages students to challenge societal norms and live authentically."
    },
    {
        "Film Name": "Memories of Murder",
        "Clue": "Here are 5 clues for you to guess the film \"Memories of Murder\":\n\n1. The film is set in a rural area of South Korea.\n2. The story revolves around a series of brutal murders.\n3. The investigation is hampered by societal and cultural factors.\n4. The film explores themes of justice and the search for truth.\n5. The ending is both shocking and thought-provoking."
    },
    {
        "Film Name": "In the Name of the Father",
        "Clue": "Here are 5 clues for you to guess the film \"In the Name of the Father\":\n\n1. The film is based on a true story.\n2. The main character faces a complex legal battle.\n3. The setting is a time of political unrest.\n4. The film explores themes of family and loyalty.\n5. The protagonist's journey is filled with hardship and uncertainty."
    },
    {
        "Film Name": "The Gold Rush",
        "Clue": "Here are 5 clues for you to guess \"The Gold Rush\":\n\n1.  A group of men travel to a remote location in search of riches.\n2.  The setting is harsh and unforgiving, with extreme weather conditions.\n3.  A character's ambition leads to a dangerous and risky pursuit.\n4.  The film explores themes of greed and the pursuit of wealth.\n5.  The film is a classic example of silent film storytelling."
    },
    {
        "Film Name": "Monsters, Inc.",
        "Clue": "Here are 5 clues for you to guess \"Monsters, Inc.\":\n\n1.  The main characters work in a place that's full of energy.\n2.  A child's laughter is a valuable resource.\n3.  The world is full of secrets that are best kept hidden.\n4.  A monster's greatest fear is a very real threat.\n5.  A friendship can be formed in the most unexpected places. \n\n\nLet me know when you think you have the answer!"
    },
    {
        "Film Name": "Wild Tales",
        "Clue": "Here are 5 clues for you to guess the film *Wild Tales*:\n\n1. The film features a diverse range of stories, each with a unique and often dark theme.\n2. The setting for many of the stories is a bustling city, filled with both beauty and danger.\n3. The film explores the complexities of human relationships, often through unexpected and humorous situations.\n4. The stories are presented in a non-linear fashion, jumping between different timelines and perspectives.\n5. The film is a blend of genres, including comedy, drama, and thriller. \n\n\nLet me know when you think you have the answer!"
    },
    {
        "Film Name": "The Deer Hunter",
        "Clue": "Here are 5 clues for you to guess \"The Deer Hunter\":\n\n1. The film depicts a pivotal moment in American history.\n2. The setting is a small, rural community.\n3. The film explores the themes of war and its impact on individuals.\n4. The characters face a difficult moral dilemma.\n5. The film uses a unique and powerful visual style."
    },
    {
        "Film Name": "The General",
        "Clue": "Here are 5 clues for you to guess \"The General\":\n\n1.  The film features a daring train journey across a treacherous landscape.\n2.  A comedic rivalry fuels the plot between two opposing forces.\n3.  A beloved train engine faces a series of mechanical challenges.\n4.  The film is known for its innovative use of special effects.\n5.  The film's climax involves a dramatic and suspenseful chase."
    },
    {
        "Film Name": "Jaws",
        "Clue": "Here are 5 clues for you to guess Jaws:\n\n1.  A small town is terrorized by a large, predatory creature.\n2.  The creature is a constant threat, lurking in the shadows.\n3.  A group of people must work together to survive.\n4.  The creature's presence creates a sense of fear and paranoia.\n5.  The film explores the dangers of the ocean and the power of nature."
    },
    {
        "Film Name": "On the Waterfront",
        "Clue": "Here are 5 clues for you to guess \"On the Waterfront\":\n\n1.  The film explores themes of loyalty, betrayal, and the struggle for justice.\n2.  The setting is a gritty and realistic portrayal of a specific time and place.\n3.  The protagonist faces a moral dilemma that forces him to confront his past.\n4.  The film features a powerful performance by a renowned actor.\n5.  The story revolves around a complex and morally ambiguous situation."
    },
    {
        "Film Name": "Sherlock Jr.",
        "Clue": "Here are 5 clues for you to guess \"Sherlock Jr.\":\n\n1. The protagonist's primary tool is a unique and specialized device.\n2. The film utilizes a distinct visual style, emphasizing a specific aspect of reality.\n3. The narrative structure is unconventional, relying on a non-linear approach.\n4. The film explores themes of obsession and the dangers of technology.\n5. The protagonist's actions have a significant impact on the lives of others."
    },
    {
        "Film Name": "How to Train Your Dragon",
        "Clue": "Here are 5 clues for you to guess \"How to Train Your Dragon\":\n\n1.  The protagonist has a unique bond with a creature that is often misunderstood.\n2.  The film takes place in a world where dragons are feared and hunted.\n3.  The main character's journey involves challenging societal norms.\n4.  The film explores themes of friendship, acceptance, and courage.\n5.  The protagonist's goal is to change the perception of dragons."
    },
    {
        "Film Name": "Ratatouille",
        "Clue": "Here are 5 clues for you to guess \"Ratatouille\":\n\n1.  It features a unique and unconventional culinary setting.\n2.  The protagonist faces significant obstacles due to societal prejudice.\n3.  The film explores themes of passion and following your dreams.\n4.  A daring culinary adventure takes place in a bustling city.\n5.  The film's animation style is both charming and realistic."
    },
    {
        "Film Name": "Mary and Max",
        "Clue": "Here are 5 clues for you to guess the film \"Mary and Max\":\n\n1. The film features a unique and unconventional art style.\n2. The story revolves around a complex and unusual relationship.\n3. The film explores themes of loneliness and connection.\n4. The setting is a blend of realism and fantasy.\n5. The film is a poignant and thought-provoking exploration of childhood."
    },
    {
        "Film Name": "The Third Man",
        "Clue": "Here are 5 clues for you to guess \"The Third Man\":\n\n1. The film's setting is a city known for its beauty and its secrets.\n2. A mysterious death throws a man's life into turmoil.\n3. A hidden message holds the key to a dangerous truth.\n4. A love triangle adds a layer of complexity to the plot.\n5. The film explores themes of morality and betrayal."
    },
    {
        "Film Name": "The Wages of Fear",
        "Clue": "Here are 5 clues for you to guess \"The Wages of Fear\":\n\n1.  A dangerous job is offered with a high reward.\n2.  The setting is a remote and unforgiving location.\n3.  The characters are driven by desperation and greed.\n4.  The film explores the psychological toll of extreme pressure.\n5.  The film's climax is a tense and suspenseful event."
    },
    {
        "Film Name": "Wild Strawberries",
        "Clue": "Here are 5 clues for you to guess the film *Wild Strawberries*:\n\n1. The film is set in a time of significant societal change.\n2. The protagonist's journey is both physical and emotional.\n3. The film explores themes of memory, regret, and the passage of time.\n4. The film features a recurring motif of nature and its connection to the human experience.\n5. The film's ending is both bittersweet and hopeful."
    },
    {
        "Film Name": "Le Mans '66",
        "Clue": "Here are 5 clues for you to guess \"Le Mans '66\":\n\n1.  The film features a tense rivalry between two drivers.\n2.  The race is a high-stakes competition with a significant prize.\n3.  The film depicts a pivotal moment in automotive history.\n4.  The setting is a thrilling and dangerous race track.\n5.  The film explores themes of determination and sacrifice."
    },
    {
        "Film Name": "Mr. Smith Goes to Washington",
        "Clue": "Here are 5 clues for you to guess \"Mr. Smith Goes to Washington\":\n\n1.  The film features a young man's journey to make a difference in a corrupt system.\n2.  The protagonist faces significant obstacles and challenges in his pursuit of justice.\n3.  The film explores themes of idealism, integrity, and the power of one person.\n4.  The setting is a bustling and often cynical political environment.\n5.  The film's message is one of hope and the importance of standing up for what is right."
    },
    {
        "Film Name": "Maharaja",
        "Clue": "Here are 5 clues for you to guess the film \"Maharaja\":\n\n1. The film features a lavish palace setting.\n2. The story revolves around a complex family dynamic.\n3. The protagonist faces a moral dilemma.\n4. The film explores themes of love and betrayal.\n5. The film is known for its stunning costumes and sets."
    },
    {
        "Film Name": "Tokyo Story",
        "Clue": "Here are 5 clues for you to guess the film Tokyo Story:\n\n1. The film explores the complexities of family relationships across generations.\n2. A significant event forces a family to confront their changing roles and responsibilities.\n3. The film is set in a specific time period, reflecting the social and cultural context of its era.\n4. The film's setting is a bustling city, yet it focuses on the intimate lives of its characters.\n5. The film's themes resonate with audiences across cultures and time periods. \n\n\nLet me know when you think you have the answer!"
    },
    {
        "Film Name": "Rocky",
        "Clue": "Here are 5 clues for you to guess the film Rocky:\n\n1.  The protagonist faces a significant challenge in a highly competitive environment.\n2.  The film features a dramatic training montage.\n3.  The story revolves around a personal journey of self-discovery.\n4.  The film explores themes of love, loss, and redemption.\n5.  The film's soundtrack is iconic and memorable."
    },
    {
        "Film Name": "Logan",
        "Clue": "Here are 5 clues for you to guess the film *Logan*:\n\n1. The setting is a desolate and unforgiving landscape.\n2. A powerful and dangerous force is on the rise.\n3. A past trauma haunts the protagonist's present.\n4. A new threat emerges with a unique and deadly power.\n5. The protagonist faces a difficult choice with life-altering consequences."
    },
    {
        "Film Name": "The Big Lebowski",
        "Clue": "Here are 5 clues for you to guess \"The Big Lebowski\":\n\n1.  The protagonist is known for his laid-back demeanor and love of bowling.\n2.  The film features a memorable scene involving a rug and a very specific type of water.\n3.  A group of friends embark on a chaotic journey to retrieve a stolen item.\n4.  The film's humor is often absurdist and relies on unexpected twists.\n5.  The film's soundtrack features a blend of classic rock and alternative music."
    },
    {
        "Film Name": "The Seventh Seal",
        "Clue": "Here are 5 clues for you to guess \"The Seventh Seal\":\n\n1.  A knight faces a philosophical dilemma while on a journey.\n2.  The setting is a medieval landscape, both beautiful and harsh.\n3.  A game of chance is used to explore the nature of life and death.\n4.  A figure of religious significance is present in the story.\n5.  The film uses symbolism to convey its themes."
    },
    {
        "Film Name": "Room",
        "Clue": "Here are 5 clues for you to guess the film \"Room\":\n\n1. The film is set in a confined space.\n2. The protagonist experiences a significant loss.\n3. The film explores themes of love and resilience.\n4. The setting is both beautiful and dangerous.\n5. The film's ending is both hopeful and heartbreaking."
    },
    {
        "Film Name": "Spotlight",
        "Clue": "Here are 5 clues for you to guess the film Spotlight:\n\n1. The film is based on a true story.\n2. The story revolves around a group of journalists.\n3. The setting is a major news organization.\n4. The film explores the power of investigative journalism.\n5. The film's ending is both impactful and thought-provoking."
    },
    {
        "Film Name": "The Terminator",
        "Clue": "Here are 5 clues for you to guess \"The Terminator\":\n\n1.  A future war is fought with advanced technology.\n2.  A lone warrior is sent back in time to prevent a catastrophic event.\n3.  A powerful artificial intelligence is the driving force behind the conflict.\n4.  A simple, everyday object becomes a symbol of danger.\n5.  The line between reality and fiction blurs as the past and future collide."
    },
    {
        "Film Name": "Hotel Rwanda",
        "Clue": "Here are 5 clues for you to guess the film \"Hotel Rwanda\":\n\n1. The film takes place during a time of intense political and social upheaval.\n2. The protagonist faces a difficult moral dilemma.\n3. The setting is a place of both beauty and danger.\n4. The film explores themes of courage and resilience.\n5. The protagonist's actions have a profound impact on the lives of others."
    },
    {
        "Film Name": "Platoon",
        "Clue": "Here are 5 clues for you to guess the film Platoon:\n\n1. The film depicts a brutal and chaotic war zone.\n2. The setting is a place of intense poverty and violence.\n3. The protagonist experiences a profound moral dilemma.\n4. The film explores themes of innocence and disillusionment.\n5. The soundtrack features a mix of traditional and modern music."
    },
    {
        "Film Name": "La haine",
        "Clue": "Here are 5 clues for you to guess \"La Haine\":\n\n1. The film is set in a specific, recognizable city.\n2. The film explores themes of social injustice and poverty.\n3. The film features a tense and volatile atmosphere.\n4. The film's soundtrack is a key element of its atmosphere.\n5. The film's ending is both impactful and thought-provoking."
    },
    {
        "Film Name": "Before Sunset",
        "Clue": "Here are 5 clues for you to guess \"Before Sunset\":\n\n1. The setting is a familiar place for a romantic encounter.\n2. A conversation about the past is central to the plot.\n3. The characters are grappling with a difficult decision.\n4. The film explores themes of love, loss, and regret.\n5. The ending leaves the audience with a sense of hope and uncertainty."
    },
    {
        "Film Name": "Pirates of the Caribbean: The Curse of the Black Pearl",
        "Clue": "Here are 5 clues for you to guess \"Pirates of the Caribbean: The Curse of the Black Pearl\":\n\n1.  The setting is a world of pirates and treasure.\n2.  A cursed pirate's ghost seeks revenge.\n3.  A young man is thrust into a world of adventure.\n4.  A magical compass guides the journey.\n5.  A love story unfolds amidst danger and intrigue."
    },
    {
        "Film Name": "Jai Bhim",
        "Clue": "Here are 5 clues for you to guess the film \"Jai Bhim\":\n\n1. The film explores a complex legal battle against a powerful system.\n2. The setting is a rural area with a strong sense of community.\n3. The film delves into themes of social justice and inequality.\n4. The story features a pivotal moment of courage and defiance.\n5. The film's message is one of hope and resilience in the face of adversity."
    },
    {
        "Film Name": "The Passion of Joan of Arc",
        "Clue": "Here are 5 clues for you to guess \"The Passion of Joan of Arc\":\n\n1.  The film is known for its innovative use of close-up shots.\n2.  The film's setting is a time of great religious and political upheaval.\n3.  The film's narrative is told through a series of intense, emotional scenes.\n4.  The film's director was a pioneer in silent film techniques.\n5.  The film's themes explore the nature of faith, power, and sacrifice."
    },
    {
        "Film Name": "The Best Years of Our Lives",
        "Clue": "Here are 5 clues for you to guess \"The Best Years of Our Lives\":\n\n1. The film explores the challenges of returning veterans to civilian life.\n2. The story focuses on the struggles of three men adjusting to a changed world.\n3. The film depicts the emotional and physical toll of war on individuals.\n4. The setting is a small town in the aftermath of World War II.\n5. The film offers a hopeful message about the resilience of the human spirit."
    },
    {
        "Film Name": "The Exorcist",
        "Clue": "Here are 5 clues for you to guess \"The Exorcist\":\n\n1.  The film features a disturbing transformation of a young girl.\n2.  The film's setting is a place of both comfort and fear.\n3.  The film explores the boundaries of faith and science.\n4.  The film's climax is a terrifying and unforgettable event.\n5.  The film's themes are both timeless and unsettling."
    },
    {
        "Film Name": "Rush",
        "Clue": "Here are 5 clues for you to guess the film *Rush*:\n\n1. The film features a rivalry that transcends the racing track.\n2. The setting is a time of intense technological advancement.\n3. The film explores the personal sacrifices made for success.\n4. The film's soundtrack is a blend of classic rock and electronic music.\n5. The film's climax is a high-stakes race with global implications."
    },
    {
        "Film Name": "Network",
        "Clue": "Here are 5 clues for you to guess the film \"Network\":\n\n1.  The film's central character is driven by a desire for power and influence.\n2.  The film explores the dark side of the media industry.\n3.  The film features a controversial and shocking act of public display.\n4.  The film's setting is a world of constant news cycles and rapid information dissemination.\n5.  The film's message is a commentary on the nature of truth and manipulation."
    },
    {
        "Film Name": "The Wizard of Oz",
        "Clue": "Here are 5 clues for you to guess \"The Wizard of Oz\":\n\n1. A yellow brick road leads to a magical destination.\n2. A powerful storm forces a journey into the unknown.\n3. A powerful force seeks to control the fate of a small town.\n4. A journey of self-discovery leads to a surprising truth.\n5. A powerful, unseen force dictates the rules of a fantastical world."
    },
    {
        "Film Name": "The Incredibles",
        "Clue": "Here are 5 clues for you to guess \"The Incredibles\":\n\n1.  The main character is a superhero with a unique ability.\n2.  The family faces a threat to their secret identity.\n3.  The film explores the challenges of balancing family life and heroism.\n4.  A villain with a powerful weapon poses a significant threat.\n5.  The film features a blend of action, humor, and heartwarming moments."
    },
    {
        "Film Name": "Stand by Me",
        "Clue": "Here are 5 clues for you to guess the film \"Stand by Me\":\n\n1.  The setting is a small town in the American Midwest.\n2.  The story is told through the eyes of a group of young boys.\n3.  A significant event occurs during a summer adventure.\n4.  The journey involves a journey of self-discovery.\n5.  The film explores themes of friendship and loss."
    },
    {
        "Film Name": "Hachi: A Dog's Tale",
        "Clue": "Here are 5 clues for you to guess the film \"Hachi: A Dog's Tale\":\n\n1. The film is based on a true story.\n2. The main character is a loyal and devoted dog.\n3. The film explores themes of love, loss, and friendship.\n4. The setting is a university campus.\n5. The film has a heartwarming and emotional ending."
    },
    {
        "Film Name": "The Sound of Music",
        "Clue": "Here are 5 clues for you to guess \"The Sound of Music\":\n\n1.  The story takes place in a beautiful, mountainous region.\n2.  A young woman leaves her life of privilege to become a governess.\n3.  The protagonist's love for music is a driving force in the film.\n4.  The film features a memorable song about a family's love.\n5.  The film explores themes of family, love, and finding your place in the world."
    },
    {
        "Film Name": "The Handmaiden",
        "Clue": "Here are 5 clues for you to guess \"The Handmaiden\":\n\n1. The film is set in a specific historical period.\n2. The story involves a complex web of relationships and secrets.\n3. The film features a unique and stylized visual aesthetic.\n4. The plot revolves around a forbidden love affair.\n5. The film explores themes of power, manipulation, and desire."
    },
    {
        "Film Name": "My Father and My Son",
        "Clue": "Here are 5 clues for you to guess the film \"My Father and My Son\":\n\n1. The film explores the complexities of a father-son relationship.\n2. The setting is a place of both beauty and hardship.\n3. The story deals with themes of love, loss, and forgiveness.\n4. The film features a powerful performance by a renowned actor.\n5. The film's message is one of hope and redemption. \n\n\nLet me know when you think you have the answer!"
    },
    {
        "Film Name": "To Be or Not to Be",
        "Clue": "Here are 5 clues for you to guess the film \"To Be or Not to Be\":\n\n1.  The setting is a place of great beauty and danger.\n2.  The main character grapples with a difficult decision.\n3.  The story explores themes of love, loss, and mortality.\n4.  The film features a powerful performance by a renowned actor.\n5.  The film's ending is both tragic and hopeful. \n\n\nLet me know when you think you have the answer!"
    },
    {
        "Film Name": "Into the Wild",
        "Clue": "Here are 5 clues for you to guess \"Into the Wild\":\n\n1. The protagonist's journey begins with a profound desire for self-discovery.\n2. The film explores the complexities of societal expectations and personal freedom.\n3. The setting plays a crucial role in shaping the protagonist's choices.\n4. The protagonist's actions are often driven by a deep sense of purpose.\n5. The film's ending is both poignant and thought-provoking."
    },
    {
        "Film Name": "The Battle of Algiers",
        "Clue": "Here are 5 clues for you to guess \"The Battle of Algiers\":\n\n1. The film depicts a complex and brutal conflict.\n2. The setting is a city under siege and facing a violent uprising.\n3. The film explores themes of political ideology and social unrest.\n4. The use of guerrilla tactics is a key element of the conflict.\n5. The film is a powerful and unflinching portrayal of war."
    },
    {
        "Film Name": "Groundhog Day",
        "Clue": "Here are 5 clues for you to guess \"Groundhog Day\":\n\n1.  The protagonist's job involves a repetitive cycle.\n2.  A weather event is the catalyst for the protagonist's unusual situation.\n3.  The protagonist's actions have a significant impact on the people around him.\n4.  The protagonist learns valuable lessons through his repeated experiences.\n5.  The film explores themes of self-discovery and personal growth."
    },
    {
        "Film Name": "The Grapes of Wrath",
        "Clue": "Here are 5 clues for you to guess \"The Grapes of Wrath\":\n\n1.  The film depicts a journey across a vast and unforgiving landscape.\n2.  The story centers around a family facing hardship and seeking a better life.\n3.  The characters are forced to confront the harsh realities of poverty and displacement.\n4.  The film explores themes of resilience, hope, and the power of community.\n5.  The setting is a time of significant social and economic upheaval."
    },
    {
        "Film Name": "The Iron Giant",
        "Clue": "Here are 5 clues for you to guess \"The Iron Giant\":\n\n1.  The protagonist is a young boy who finds a strange object in his backyard.\n2.  The object is a powerful force that can change the world.\n3.  The object is initially feared by the adults in the town.\n4.  The object is a symbol of hope and understanding.\n5.  The object's arrival sparks a conflict between two opposing forces."
    },
    {
        "Film Name": "Amores perros",
        "Clue": "Here are 5 clues for you to guess the film *Amores Perros*:\n\n1. The film explores themes of fate and chance.\n2. The story is set in a bustling, urban environment.\n3. A central conflict revolves around a complex web of relationships.\n4. The film utilizes a non-linear narrative structure.\n5. The film's ending is both tragic and hopeful."
    },
    {
        "Film Name": "Rebecca",
        "Clue": "Here are 5 clues for you to guess \"Rebecca\":\n\n1. The setting is a grand estate with a dark and mysterious past.\n2. A young woman arrives at a remote mansion, seeking a new life.\n3. The protagonist is haunted by the memory of a deceased woman.\n4. A sense of unease and tension permeates the atmosphere.\n5. The story explores themes of love, loss, and the complexities of human relationships."
    },
    {
        "Film Name": "Cool Hand Luke",
        "Clue": "Here are 5 clues for you to guess \"Cool Hand Luke\":\n\n1.  The film is set in a harsh and unforgiving environment.\n2.  The protagonist is known for his rebellious spirit and defiance.\n3.  The film explores themes of freedom and the American dream.\n4.  The film features a memorable prison scene with a powerful message.\n5.  The film's ending is both hopeful and bittersweet."
    },
    {
        "Film Name": "The Help",
        "Clue": "Here are 5 clues for you to guess \"The Help\":\n\n1. The story is set in the American South during a specific historical period.\n2. The film explores themes of racial prejudice and social injustice.\n3. The main characters face difficult choices and navigate complex relationships.\n4. The setting is a place where secrets and hidden truths are kept.\n5. The film features a powerful message about the importance of empathy and understanding."
    },
    {
        "Film Name": "It Happened One Night",
        "Clue": "Here are 5 clues for you to guess \"It Happened One Night\":\n\n1.  The film features a young woman who is trying to escape her wealthy family.\n2.  The main character is a reporter who is determined to get the story.\n3.  The film is a classic romantic comedy.\n4.  The setting of the film is a time of social change.\n5.  The film won multiple awards at the Academy Awards. \n\n\nLet me know when you think you have the answer!"
    },
    {
        "Film Name": "Aladdin",
        "Clue": "Here are 5 clues for you to guess the film Aladdin:\n\n1. The main character wishes for a life of luxury and adventure.\n2. A magical lamp holds the key to a powerful genie.\n3. A street rat becomes a prince for a short time.\n4. A villain seeks to steal a powerful object.\n5. A song about a magical carpet takes the audience on a journey."
    },
    {
        "Film Name": "Paris, Texas",
        "Clue": "Here are 5 clues for you to guess the film *Paris, Texas*:\n\n1. The film's setting is a place of both beauty and desolation.\n2. A journey of self-discovery is central to the plot.\n3. The protagonist is haunted by a past he desperately tries to escape.\n4. The film explores themes of love, loss, and the search for meaning.\n5. The film's soundtrack is a powerful and evocative blend of genres."
    },
    {
        "Film Name": "Drishyam",
        "Clue": "Here are 5 clues for you to guess \"Drishyam\":\n\n1. The film revolves around a family's desperate attempt to protect their loved ones.\n2. The protagonist is a man who uses his knowledge of technology to his advantage.\n3. The film explores the complexities of family relationships and the lengths people will go to for them.\n4. The setting is a small, close-knit community where secrets can easily be kept.\n5. The film's climax involves a high-stakes game of cat and mouse."
    }
]